tNormalFlagPos = 		--²»¿ÉÖØÉúÆì×ÓµÄ×ø±ê--
{
	[1] = {1300,2962,"§¹i kú §«ng thµnh","§¹i kú thµnh m«n"},
	[2] = {1293,2779,"§¹i kú Trung khu","§¹i kú thµnh m«n"},
	[3] = {1100,2764,"§¹i kú T©y thµnh","§¹i kú thµnh m«n"},
}
tReviviFlagPos = 		--¿ÉÖØÉúÆì×ÓµÄ×ø±ê--
{
	[1] = {1280,2622,"HuyÒn vò kú T©y thµnh","ChiÕm ®­îc Lam kú","ChiÕm ®­îc Hång kú"},
	[2] = {1453,2794,"HuyÒn vò kú §«ng thµnh","ChiÕm ®­îc Lam kú","ChiÕm ®­îc Hång kú"},
	[3] = {1183,2630,"B¹ch Hæ kú T©y thµnh","ChiÕm ®­îc Lam kú","ChiÕm ®­îc Hång kú"},
	[4] = {1318,2750,"ThÊt Tinh kú","ChiÕm ®­îc Lam kú","ChiÕm ®­îc Hång kú"},
	[5] = {1437,2881,"Thanh Long kú §«ng thµnh","ChiÕm ®­îc Lam kú","ChiÕm ®­îc Hång kú"},
	[6] = {1162,2739,"Chu T­íc kú T©y thµnh","ChiÕm ®­îc Lam kú","ChiÕm ®­îc Hång kú"},
	[7] = {1336,2912,"Chu T­íc kú §«ng thµnh","ChiÕm ®­îc Lam kú","ChiÕm ®­îc Hång kú"},
}
tGraveyardPos = 		--Ä¹µØ×ø±ê--
{
	[1] = {{986,2973}},	--A1
	[2] = {{1108,3067}},	--A2
	[3] = {{1119,2880}},	--B1
	[4] = {{1204,2962}},	--B2
	[5] = {{1146,2810}},	--C1
	[6] = {{1258,2942}},	--C2
	[7] = {{1382,2582}},	--11
	[8] = {{1485,2685}},	--12
	[9] = {{1191,2641}},	--21
	[10] = {{1425,2875}},	--22
}
tChengMenJiGuanPos = 	--³ÇÃÅ»ú¹Ø×ø±ê--
{
	[1] = {1253,3023,"C¬ quan §«ng thµnh m«n","C¬ quan thµnh m«n"},
	[2] = {1181,2893,"C¬ quan thµnh m«n trung khu","C¬ quan thµnh m«n"},
	[3] = {1055,2830,"C¬ quan T©y thµnh m«n","C¬ quan thµnh m«n"},
}
tFightingPos = 			--µ¥Ìô³¡µØ×ø±ê--
{
	[1] = {1343,3052},
	[2] = {1387,3006},
	[3] = {1443,2954},
}
tFightRoomExit = 		--µ¥Ìô³¡µØ´«³öµã
{
	[1] = {{1183,3078},{1302,2993}},
	[2] = {{1102,2976},{1258,2865}},
	[3] = {{1005,2905},{1064,2762}},
}

tEntrancePos = 			--Èë¿Ú×ø±ê£¬¹¥³ÇµØÍ¼ÄÚ
{
	[1] = {1132,3153},
	[2] = {1457,2578},
}

tExitPos = 
{
	[1] = {{100,1407,2993},{300,1732,3563},{350,1431,3000}},
	[2] = {{100,1424,2995},{300,1753,3570},{350,1452,3000}},
}