--从襄阳任务以后的触发器列表
--created by lizhi
--2005-8-24 10:58

KILL_BJ_LM      = 90;   --汴京任务杀死流氓
KILL_BJ_WL      = 91;   --汴京任务杀死无赖
TIME_BJ_XH      = 90;   --汴京任务萧寒计时器
LOG_BJ_XH       = 91;   --汴京任务萧寒LOG触发器
RECT_BJ_XH      = 92;   --汴京任务萧寒RECT触发器

----------------------------------------------------------------------

KILL_CD_TL      = 153;  --成都任务杀小土狼
KILL_CD_QL      = 154;  --成都任务杀小青狼
KILL_CD_BRJ     = 153;  --成都任务杀白日箭
KILL_CD_XT      = 155;  --成都任务杀小偷
KILL_CD_FZ      = 156;  --成都任务杀飞贼

----------------------------------------------------------------------

TALK_XY_GSS     = 157;  --襄阳任务公孙书对话
TALK_XY_JT      = 159;  --襄阳任务剑僮对话
TALK_XY_JD      = 159;  --襄阳任务慕雪山庄家丁对话
TALK_XY_TBQ     = 159;  --襄阳任务拓跋其对话
TALK_XY_SZ      = 159;  --襄阳任务落魄的山贼对话

KILL_XY_LAOHU   = 162;  --襄阳任务杀死老虎
KILL_XY_LIEHU   = 162;  --襄阳任务杀死猎户
KILL_XY_MXSZ    = 162;  --襄阳任务屠杀慕雪山庄

KILL_XY_DB      = 162;  --襄阳任务杀死西夏假扮的宋刀兵
KILL_XY_QB      = 163;  --襄阳任务杀死西夏假扮的宋枪兵
KILL_XY_JMG     = 162;  --襄阳任务杀死剑门关内的西夏士兵
KILL_XY_JL      = 162;  --襄阳任务杀死西夏将领
KILL_XY_SD      = 162;  --襄阳任务屠杀剑阁蜀道
KILL_XY_NJX     = 162;  --襄阳任务杀女剑侠
KILL_XY_DYX     = 162;  --襄阳任务破坏毒药箱
KILL_XY_LDB     = 162;  --襄阳任务杀死辽刀兵
KILL_XY_LQB     = 163;  --襄阳任务杀死辽枪兵
KILL_XY_LNB     = 164;  --襄阳任务杀死辽弩兵
KILL_XY_XS      = 162;  --襄阳任务杀死西夏邪僧
KILL_XY_ZS      = 162;  --襄阳任务杀死西夏咒师

LEAVE_GAME_XY   = 163;  --襄阳任务杀九头金凤时离开游戏
LEAVE_RECT_XY   = 164;  --襄阳任务杀九头金凤时离开地图

----------------------------------------------------------------------

KILL_YZ_LAOHU   = 173;  --扬州任务杀死老虎
KILL_YZ_CK      = 173;  --扬州任务杀死草寇
KILL_YZ_DCC     = 173;  --扬州任务杀死毒蟾蜍
KILL_YZ_WS      = 173;  --扬州任务杀死天阴武士

KILL_YZ_TX      = 174;  --扬州任务杀死天蝎
KILL_YZ_BG      = 174;  --扬州任务屠杀武夷山
KILL_YZ_CY      = 174;  --扬州任务杀死沧袁
KILL_YZ_YH      = 174;  --扬州任务杀死银狐
KILL_YZ_QS      = 174;  --扬州任务杀死枪神
KILL_YZ_JT      = 174;  --扬州任务杀死蚩火教徒

KILL_YZ_SZ      = 166;  --扬州任务杀死水族
KILL_YZ_SZSB    = 167;  --扬州任务杀死水族士兵

KILL_JJC_LAOHU  = 168;  --江津村任务杀死老虎
KILL_JJC_FS     = 168;  --江津村任务杀腐尸
KILL_JJC_XS     = 169;  --江津村任务杀行尸
KILL_JJC_WJH    = 168;  --江津村任务取得望江红
KILL_JJC_HY     = 168;  --江津村任务杀死黑鸦
KILL_JJC_SN     = 168;  --江津村任务杀死乌盟部少女
KILL_JJC_ZR     = 169;  --江津村任务杀死乌盟族人
KILL_JJC_YS     = 170;  --江津村任务杀死乌盟勇士
KILL_JJC_SW     = 168;  --江津村任务打败宋万
KILL_JJC_LL     = 169;  --江津村任务打败李立
KILL_JJC_G      = 170;  --江津村任务打败顾大嫂
KILL_JJC_TR     = 168;  --江津村任务杀铜人
KILL_JJC_JK     = 168;  --江津村任务杀剑狂
KILL_JJC_DJ     = 169;  --江津村任务杀刀绝

LEAVE_GAME_JJC  = 168;  --江津村任务杀陈飞扬时离开游戏
LEAVE_RECT_JJC  = 169;  --江津村任务杀陈飞扬时离开地图