--*************
-- Hat giong --
--*************

--=============================================
--create by baiyun 2009.5.30
--describe:Ô½ÄÏ°æ7ÔÂ·Ý»î¶¯Í·ÎÄ¼þ
--=============================================
Include("\\script\\lib\\globalfunctions.lua");
Include("\\script\\lib\\writelog.lua");

EVENT_DATE_START = 09061900;
EVENT_DATE_END = {09071924, 09080224, 09113024};
EXT_POINT = 0;

TASK_TREE_INDEX       = 2056;				--¼ÇÂ¼Íæ¼ÒÖÖµÄÊ÷µÄNPCË÷Òý
TASK_TREE_GROW        = 2057;				--¼ÇÂ¼Ê÷µÄÉú³É³Ì¶È
TASK_WATER_TREE_TIME  = 2058;				--¼ÇÂ¼¸øÊ÷½½Ë®µÄÊ±¼äµã£¬¸ÕÖÖÏÂ»¹Î´½½Ë®Ê±¼´ÎªÖÖÏÂµÄÊ±¼ä
TASK_PLANT_TREE_COUNT = 2059;		    --¼ÇÂ¼Íæ¼Òµ±ÌìÖÖÊ÷µÄ´ÎÊý
TASK_PLANT_TREE_DATE  = 2060;				--¼ÇÂ¼Íæ¼ÒÖÖÏÂÊ÷µÄÈÕÆÚ
TASK_PLANT_TREE_TIME  = 2061;				--¼ÇÂ¼Íæ¼ÒÉÏ´ÎÖÖÊ÷µÄÊ±¼ä,(Ã¿´ÎÖÖÏÂÊ÷ºó¶¼Òª¸üÐÂ´ËÖµ,ÓÃÀ´ÏÞÖÆÁ½´ÎÁ¬¼ÌÖÖÊ÷)
TASK_PLANT_TREE_TYPE  = 2062;				--ÖÖÏÂÊ÷µÄÀàÐÍ 1 - 5

TASK_LAST_USE_DATE = 2063 --ÉÏ´ÎÊ¹ÓÃÑÌ»¨µÄÊ±¼ä
TASK_TODAY_USE_COUNT = 2064 --½ñÌìÒÑ¾­Ê¹ÓÃµÄÑÌ»¨µÄ¸öÊý
TASK_LAST_GET_DATE = 2065 --ÉÏ´ÎÁìÈ¡ÑÌ»¨µÄÊ±¼ä
TASK_TODAY_GET_COUNT = 2066 --½ñÌìÒÑ¾­ÁìÈ¡ÑÌ»¨µÄ¸öÊý

TASK_GET_FUZHU_DATE = 2067--ÉÏ´Î»ñµÃ¸¨ÖúÐ§¹ûµÄÈÕÆÚ

TASK_USE_CHANGSHENGPU_EXP = 2068--Ê¹ÓÃ³¤ÉúÆÕÒÑ¾­»ñµÃµÄ¾­Ñé
TASK_GET_MIBEN_DATE = 2069--Íæ¼ÒÉÏ´ÎÔÚÊ¦ÃÅÈÎÎñÖÐ»ñµÃ³Â¾ÉÃØ±¾µÄÈÕÆÚ
TASK_GET_MIBEN_COUNT_TODAY = 2070--Íæ¼Ò½ñÌìÔÚÊ¦ÃÅÈÎÎñÖÐ»ñµÃ³Â¾ÉÃØ±¾µÄÊýÁ¿

TASK_USE_YANHUA_TIME = 2071--Ê¹ÓÃÑÌ»¨µÄÊ±¼ä

TASK_WUHUCANGLONG_GET = 2072--ÊÇ·ñÁìÈ¡ÎÔ»¢²ØÁú½±Àø

TASK_YINGXIONG_GET = 2073--Õù¶áÓ¢ÐÛÖ®Î»½±ÀøÊÇ·ñÁìÈ¡¹ý

CONST_USE_YANHUA_INTERVAL = 5 * 60--Ê¹ÓÃÑÌ»¨µÄÊ±¼ä¼ä¸ô

-- *****************
PLANT_TREE_LIMIT = 24;					--Ã¿ÌìÖÖÊ÷µÄ×î´óÊýÁ¿     20101122
-- *****************

PLANT_TREE_INTERVAL = 2 * 60;		--Á½´ÎÁ¬ÐøÖÖÊ÷µÄ¼ä¸ô
PLANT_TREE_ROLE_LEVEL_LIMIT = 10;					--¿ÉÒÔÖÖÊ÷µÄ½ÇÉ«µÈ¼¶ÏÞÖÆ
PLANT_TREE_REWARD_ITEM_TIME_LIMIT = 7 * 24 * 60 * 60; --½±ÀøÎïÆ·µÄÊ¹ÓÃÆÚÏÞ
PLANT_TREE_REWARD_ITEM_TIME_LIMIT1 = 30 * 24 * 60 * 60;--½±ÀøÎïÆ·µÄÊ¹ÓÃÆÚÏÞ¶þ


CONST_MAX_USE_COUNT = 8						--Ã¿Ìì×î¶àÊ¹ÓÃµÄÑÌ»¨ÊýÁ¿
CONST_MAX_GET_COUNT = 8						--Ã¿Ìì×î¶àÁìÈ¡µÄÑÌ»¨µÄÊýÁ¿
CONST_USE_GIVE_EXP = 100000				--Ê¹ÓÃÑÌ»ðËù¸øµÄ¾­ÑéÊýÁ¿
CONST_USE_INTERVAL = 5 * 60				--Ê¹ÓÃ¼ä¸ô5·ÖÖÓ

CONST_USE_CHANGSHENGPU_EACH_EXP = 125000		--Íæ¼ÒÊ¹ÓÃ³¤ÉúÆÕÃ¿´Î»ñµÃµÄ¾­ÑéÊýÁ¿
CONST_USE_CHANGSHENGPU_MAX_EXP = 200000000	--Íæ¼ÒÊ¹ÓÃ³¤ÉúÆÕ×î¶à»ñµÃµÄ¾­ÑéÉÏÏÞ

CONST_GET_MIBEN_MAX_COUNT = 10--Íæ¼ÒÃ¿ÌìÔÚÊ¦ÃÅÈÎÎñÖÐ×î¶à»ñµÃµÄ³Â¾ÉÃØ±¾µÄ´ÎÊý

--ÄÚ¹¦¸¨Öú¹¦ÄÜ,ÊôÐÔ×Ö·û´®£¬³öÏÖ¸ÅÂÊ£¬ÒªÐÞ¸ÄµÄÊôÐÔÖµ£¬ËµÃ÷
tb_InBuff = {
					{"T¨ng 5% sinh lùc", 20, {{"state_life_max_percent_add", 5}}},
					{"T¨ng 5% néi lùc", 20, {{"state_neili_max_percent_add", 5}}},
					{"T¨ng 5% s¸t th­¬ng néi c«ng", 20, {{"state_m_attack_percent_add", 5}}},
					{"T¨ng 5% phßng thñ néi c«ng", 20, {{"state_magic_parmor_per_add", 5}}},
					{"Kh¸ng tÊt c¶ +20", 10, {{"state_add_dexterity", 20},{"state_add_energy", 20},{"state_add_observe", 20},{"state_add_strength",20},{"state_add_vitality", 20}}},
					{"T¨ng s¸t th­¬ng néi c«ng vµ phßng thñ néi c«ng 5%", 10, {{"state_m_attack_percent_add", 5}, {"state_magic_parmor_per_add", 5}}}
};

--Íâ¹¦¸¨Öú¹¦ÄÜ
tb_OutBuff = {
					{"T¨ng 5% sinh lùc", 20, {{"state_life_max_percent_add", 5}}},
					{"T¨ng 5% néi lùc", 20, {{"state_neili_max_percent_add", 5}}},
					{"T¨ng 5% s¸t th­¬ng ngo¹i c«ng", 20, {{"state_p_attack_percent_add", 5}}},
					{"T¨ng 5% phßng thñ ngo¹i c«ng", 20, {{"state_physical_parmor_per_add", 5}}},
					{"Kh¸ng tÊt c¶ +20", 10, {{"state_add_dexterity", 20},{"state_add_energy", 20},{"state_add_observe", 20},{"state_add_strength",20},{"state_add_vitality", 20}}},
					{"T¨ng s¸t th­¬ng ngo¹i c«ng vµ phßng thñ ngo¹i c«ng 5%", 10, {{"state_p_attack_percent_add", 5}, {"state_physical_parmor_per_add", 5}}}
};

--ÌØÐ§±¦Ïä½±ÀøÁÐ±í,Ëæ»ú»ùÊýÊÇ10000
tb_texiaobaoxiang_aword = {
				{--ÌØÐ§±¦Ïä½±ÀøÁÐ±í,Ëæ»ú»ùÊýÊÇ10000,±ê×¼ÄÐ
					{"Tµng KiÕm Kim Ên", 1, 0, 102, 40, 1},
					{"Tµng KiÕm Kú Th¹ch", 1, 0, 102, 39, 1},
					{"Tµng KiÕm Tö Kim m·o", 1, 0, 103, 95, 1},
					{"Tµng KiÕm B¶o Ch©u", 2000, 0, 102, 38, 1},
					{"Kim Lò Th­êng", 2000, 0, 100, 95, 1},
					{"Tµng KiÕm ¤ kim phôc", 2000, 0, 101, 95, 1},
					{"Tr­ëng L·o ChØ Hoµn", 3997, 0, 102, 37, 1}
				},
				
				{--ÌØÐ§±¦Ïä½±ÀøÁÐ±í,Ëæ»ú»ùÊýÊÇ10000,»±ÎàÄÐ
					{"Tµng KiÕm Kim Ên", 1, 0, 102, 40, 1},
					{"Tµng KiÕm Kú Th¹ch", 1, 0, 102, 39, 1},
					{"Tµng KiÕm Tö Kim m·o", 1, 0, 103, 96, 1},
					{"Tµng KiÕm B¶o Ch©u", 2000, 0, 102, 38, 1},
					{"Kim Lò Th­êng", 2000, 0, 100, 96, 1},
					{"Tµng KiÕm ¤ kim phôc", 2000, 0, 101, 96, 1},
					{"Tr­ëng L·o ChØ Hoµn", 3997, 0, 102, 37, 1}
				},
				
				{--ÌØÐ§±¦Ïä½±ÀøÁÐ±í,Ëæ»ú»ùÊýÊÇ10000,ÐÔ¸ÐÅ®
					{"Tµng KiÕm Kim Ên", 1, 0, 102, 40, 1},
					{"Tµng KiÕm Kú Th¹ch", 1, 0, 102, 39, 1},
					{"Tµng KiÕm Tö Kim m·o", 1, 0, 103, 97, 1},
					{"Tµng KiÕm B¶o Ch©u", 2000, 0, 102, 38, 1},
					{"Kim Lò Th­êng", 2000, 0, 100, 97, 1},
					{"Tµng KiÕm ¤ kim phôc", 2000, 0, 101, 97, 1},
					{"Tr­ëng L·o ChØ Hoµn", 3997, 0, 102, 37, 1}
				},
				
				{--ÌØÐ§±¦Ïä½±ÀøÁÐ±í,Ëæ»ú»ùÊýÊÇ10000,½¿Ð¡Å®
					{"Tµng KiÕm Kim Ên", 1, 0, 102, 40, 1},
					{"Tµng KiÕm Kú Th¹ch", 1, 0, 102, 39, 1},
					{"Tµng KiÕm Tö Kim m·o", 1, 0, 103, 98, 1},
					{"Tµng KiÕm B¶o Ch©u", 2000, 0, 102, 38, 1},
					{"Kim Lò Th­êng", 2000, 0, 100, 98, 1},
					{"Tµng KiÕm ¤ kim phôc", 2000, 0, 101, 98, 1},
					{"Tr­ëng L·o ChØ Hoµn", 3997, 0, 102, 37, 1}
				},
};

--Ê¹ÓÃ³¤ÉúÆÕ»ñµÃµÄ½±ÀøÁÐ±í£¬Ëæ»ú»ùÊýÊÇ1000000000
--ÎïÆ·Ãû£¬³öÏÖ¸ÅÂÊ / 1000000000 , ´óÀàÐÍ£¬¸±ÀàÐÍ£¬ÏêÏ¸ÀàÐÍ£¬Ê¹ÓÃÆÚÏÞ, ·¢·ÅÊýÁ¿
tb_changshengpu_aword = {
					{"M¶nh Thiªn th¹ch", 17500000, 2, 2, 7, 0, 1},
					{"Thiªn th¹ch", 20000000, 2, 2, 8, 0, 1},
					{"M¶nh B¨ng th¹ch", 20000000, 2, 1, 148, 0, 1},
					{"B¨ng th¹ch", 20000000, 2, 1, 149, 0, 1},
					{"Tµng KiÕm anh hïng thiÕp", 15000000, 2, 0, 31, 30 * 24 * 60 * 60, 1},
					{"ThÕ Th©n phï", 15000000, 2, 0, 556, 30 * 24 * 60 * 60, 1},
					{"Tiªu KiÕp t¸n", 10000000, 2, 0, 141, 30 * 24 * 60 * 60, 1},
					{"TÈy Tñy ®¬n", 4688, 2, 0, 136, 30 * 24 * 60 * 60, 1},
					{"Thiªn Hµ MËt tÞch", 750000, 0, 107, 64, 0, 1},
					{"Tö Hµ MËt tÞch", 750000, 0, 107, 65, 0, 1},
					{"Chiªm Y Phæ", 375000, 0, 107, 66, 0, 1},
					{"B¶o r­¬ng Tµng KiÕm ®Çu qu¸n", 20000, 2, 1, 1059, 7 * 24 * 60 * 60, 1},
					{"B¶o r­¬ng Tµng KiÕm y gi¸p", 20000, 2, 1, 1060, 7 * 24 * 60 * 60, 1},
					{"B¶o r­¬ng Tµng KiÕm hoa khè", 20000, 2, 1, 1061, 7 * 24 * 60 * 60, 1},
					{"B¶o r­¬ng Tµng KiÕm trang søc", 10000, 2, 1, 1062, 7 * 24 * 60 * 60, 1},
					{"B¶o r­¬ng Tµng KiÕm vò khÝ", 10000, 2, 1, 1063, 7 * 24 * 60 * 60, 1},
					{"Phong th­ëng lÖnh_Liªu(Tiªn Phong)", 20000, 2, 1, 9985, 7 * 24 * 60 * 60, 1},
					{"Phong th­ëng lÖnh_Tèng(Tiªn Phong)", 20000, 2, 1, 9986, 7 * 24 * 60 * 60, 1},
					{"R­¬ng BÝ KÝp", 416667, 2, 1, 30093, 30 * 24 * 60 * 60, 1},
					{"B¶n vÏ ®óc t¹o thÇn khÝ", 304688, 2, 1, 1086, 0, 1},
					{"B¶o R­¬ng §Æc BiÖt", 4688, 2, 1, 30091, 30 * 24 * 60 * 60, 1},
					{"§ång TiÒn Vµng", 20000000, 2, 1, 30094, 0, 1},
					{"Lé thñy", 630004688, 2, 0, 351, 0, 1},
					{"Tranh S¾c Yªn Hoa", 69769583, 2, 1, 189, 0, 1},
					{"Lam S¾c Yªn Hoa", 80000000, 2, 1, 190, 0, 1},
					{"èng B«ng GiÊy", 80000000, 2, 1, 30092, 30 * 24 * 60 * 60, 1},
};

--Ê¹ÓÃÃØ¼®Ïä»ñµÃµÄ½±ÀøÁÐ±í£¬Ëæ»ú»ùÊýÊÇ1000
tb_mijixiang_aword={
				{"Kim Cang Phôc Ma kinh", 40, 0, 107, 1, 1},
				{"TiÒm Long MËt tÞch", 40, 0, 107, 3, 1},
				{"V« TrÇn MËt tÞch", 35, 0, 107, 5, 1},
				{"Thiªn La MËt TÞch", 35, 0, 107, 7, 1},
				{"Nh­ ý MËt TÞch", 35, 0, 107, 9, 1},
				{"BÝch H¶i Phæ", 35, 0, 107, 11, 1},
				{"Hçn §én MËt tÞch", 35, 0, 107, 13, 1},
				{"Quý Thiªn MËt tÞch", 35, 0, 107, 15, 1},
				{"HuyÒn ¶nh MËt tÞch", 35, 0, 107, 17, 1},
				{"Qu©n Tö MËt tÞch", 35, 0, 107, 19, 1},
				{"TrÊn Qu©n MËt tÞch", 35, 0, 107, 21, 1},
				{"Xuyªn V©n MËt tÞch", 35, 0, 107, 23, 1},
				{"U Minh Quû Lôc", 35, 0, 107, 25, 1},
				{"Linh Cæ MËt tÞch", 35, 0, 107, 27, 1},
				{"Kim Cang Phôc Ma T©m Ph¸p", 40, 0, 107, 2, 1},
				{"TiÒm Long T©m Ph¸p", 40, 0, 107, 4, 1},
				{"V« TrÇn T©m Ph¸p", 35, 0, 107, 6, 1},
				{"Thiªn La T©m Ph¸p", 35, 0, 107, 8, 1},
				{"Nh­ ý T©m Ph¸p", 35, 0, 107, 10, 1},
				{"BÝch H¶i T©m Ph¸p", 35, 0, 107, 12, 1},
				{"Hçn §én T©m Ph¸p", 35, 0, 107, 14, 1},
				{"Quý Thiªn T©m Ph¸p", 35, 0, 107, 16, 1},
				{"HuyÒn ¶nh T©m Ph¸p", 35, 0, 107, 18, 1},
				{"Qu©n Tö T©m Ph¸p", 35, 0, 107, 20, 1},
				{"TrÊn Qu©n T©m Ph¸p", 35, 0, 107, 22, 1},
				{"Xuyªn V©n T©m Ph¸p", 35, 0, 107, 24, 1},
				{"U Minh T©m Ph¸p", 35, 0, 107, 26, 1},
				{"Linh Cæ T©m Ph¸p", 35, 0, 107, 28, 1}
};

--Ê¹ÓÃÅÖÍÃ×Ó±¦Ïä»ñµÃµÄ½±ÀøÁÐ±í£¬Ëæ»ú»ùÊýÊÇ1000000
--ÎïÆ·Ãû£¬¸ÅÂÊ£¬Ìí¼Ó²ÎÊý£¬´æÔÚÊ±¼ä, ÎïÆ·ÀàÐÍ,1ÆÕÍ¨ÎïÆ·£¬2½ð×Ó
tb_pangtuzi_aword = {
				{"Tö Kim Hång Bao", 1160, {2, 1, 536, 1}, 7 * 24 * 60 * 60, 1},
				{"§¹i hång bao hoµng kim", 580, {2, 1, 538, 1}, 7 * 24 * 60 * 60, 1},
				{"B¶o r­¬ng Tµng KiÕm ®Çu qu¸n", 1740, {2, 1, 1059, 1}, 7 * 24 * 60 * 60, 1},
				{"B¶o r­¬ng Tµng KiÕm y gi¸p", 2310, {2, 1, 1060, 1}, 7 * 24 * 60 * 60, 1},
				{"B¶o r­¬ng Tµng KiÕm hoa khè", 1740, {2, 1, 1061, 1}, 7 * 24 * 60 * 60, 1},
				{"B¶o r­¬ng Tµng KiÕm trang søc", 1160, {2, 1, 1062, 1}, 7 * 24 * 60 * 60, 1},
				{"B¶o r­¬ng Tµng KiÕm vò khÝ", 1740, {2, 1, 1063, 1}, 7 * 24 * 60 * 60, 1},
				{"1 vµng", 848580, 1, 0, 2},
				{"100 vµng", 1000, 100, 0, 2},
				{"1000 vµng", 1, 1000, 0, 2},
				{"BÝ Phæ Cò N¸t", 10000, {2, 1, 30088, 50}, 0, 1},
				{"M¶nh Thiªn th¹ch", 3000, {2, 2, 7, 1}, 0, 1},
				{"Thiªn th¹ch", 1000, {2, 2, 8, 1}, 0, 1}
};

--Ê¦ÃÅÈÎÎñÖÐ½ÇÉ«»ñµÃ³Â¾ÉÃØ±¾ÊýÁ¿
--½ÇÉ«µÈ¼¶£¬Ã¿´Î»ñµÃ³Â¾ÉÃØ±¾µÄÊýÁ¿
tb_shimen_aword = {
					{1, 0},
					{2, 0},
					{3, 0},
					{4, 0},
					{5, 30},
					{6, 40},
					{7, 50},
					{8, 60},
					{9, 80},
		};

--Ò¹²ÝNPC´¦¶Ò»»µÄ½±Àø,Ãû×Ö¡¢Ìí¼Ó²ÎÊý¡¢Ðè½ðÍ­Ç®ÊýÁ¿¡¢´æÔÚÆÚÏÞ
tb_yecao_aword = {
					{"§¹i B¹ch C©u hoµn", {2, 1, 1007, 1}, 1, 30 * 24 * 60 * 60},
					{"C­êng Tam Thanh hoµn", {2, 1, 1098, 1}, 1, 30 * 24 * 60 * 60},
					{"C­êng Lôc ThÇn hoµn", {2, 1, 1065, 1}, 1, 30 * 24 * 60 * 60},
					{"Cöu chuyÓn håi hån ®¬n", {1, 0, 32, 1}, 1, 30 * 24 * 60 * 60},
					{"Thiªn H­¬ng CÈm Tôc-tói nhá", {2, 1, 1031, 1}, 1, 30 * 24 * 60 * 60},
					{"NhÊt Nguyªn Phôc Thñy §¬n (tiÓu)", {2, 1, 1033, 1}, 1, 30 * 24 * 60 * 60},
					{"Ngò Hoa Ngäc Lé hoµn-tói nhá", {2, 1, 1035, 1}, 1, 30 * 24 * 60 * 60},
					{"Bång Lai Tiªn §¬n", {2, 1, 1013, 1}, 2, 30 * 24 * 60 * 60},
					{"V¹n VËt Quy Nguyªn §¬n (tiÓu)", {2, 1, 495, 1}, 2, 30 * 24 * 60 * 60},
					{"TiÓu ThÇn Th«ng Phï", {2, 1, 497, 1}, 2, 0},
					{"TiÓu Niªn Thó ThÇn Phï", {2, 1, 498, 1}, 3, 0},
					{"H¾c Ngäc §o¹n Tôc Cao (tiÓu)", {2, 1, 489, 1}, 3, 30 * 24 * 60 * 60},
					{"B¹ch C©u Tiªn ®¬n", {2, 1, 1008, 1}, 4, 30 * 24 * 60 * 60},
					{"Tam Thanh Tiªn ®¬n", {2, 1, 1099, 1}, 4, 30 * 24 * 60 * 60},
					{"Lôc ThÇn Tiªn ®¬n", {2, 1, 1066, 1}, 4, 30 * 24 * 60 * 60},
					{"Sinh Sinh Hãa T¸n (tiÓu)", {2, 1, 483, 1}, 4, 30 * 24 * 60 * 60},
					{"Lôc L©m Lang Yªn", {2, 1, 1014, 1}, 5, 30 * 24 * 60 * 60},
					{"Thñy Hoµng BÝ ChiÕu", {2, 1, 1047, 1}, 5, 30 * 24 * 60 * 60},
					{"Uyªn ¦¬ng Kim Ti B¹c", {2, 1, 1048, 1}, 7, 30 * 24 * 60 * 60},
					{"Sæ tay sèng", {2, 19, 1, 1}, 20, 30 * 24 * 60 * 60},
					{"ThÇn hµnh b¶o ®iÓn", {0, 200, 40, 1}, 25, 30 * 24 * 60 * 60},
					{"Qu©n C«ng Huy Hoµng", {2, 1, 9977, 1}, 50, 30 * 24 * 60 * 60},
					{"TÈy Tñy linh ®¬n", {2, 0, 137, 1}, 80, 30 * 24 * 60 * 60},
					{"B¸t B¶o TÈy Tñy Tiªn §¬n", {2, 0, 138, 1}, 100, 30 * 24 * 60 * 60},
					{"Phiªu Vò", {0, 105, 15, 1, 1, -1, -1, -1, -1, -1, -1}, 250, 30 * 24 * 60 * 60}
};

--Õù¶áÓ¢ÐÛÖ®Î»½±Àø,±ê×¼ÄÐ-»±ÎàÄÐ-ÐÔ¸ÐÅ®-½¿Ð¡Å®
tb_yingxiong_aword = {
				{{"Viªm §Õ kh«i",0,103,8001},{"Viªm §Õ kh«i",0,103,8002},{"Viªm §Õ kh«i",0,103,8003},{"Viªm §Õ kh«i",0,103,8004}},
				{{"Viªm §Õ gi¸p",0,100,8001},{"Viªm §Õ gi¸p",0,100,8002},{"Viªm §Õ gi¸p",0,100,8003},{"Viªm §Õ gi¸p",0,100,8004}},
				{{"Viªm §Õ trang",0,101,8001},{"Viªm §Õ trang",0,101,8002},{"Viªm §Õ trang",0,101,8003},{"Viªm §Õ trang",0,101,8004}}
};

--ÎÔ»¢²ØÁú½±Àø£¬µÈ¼¶-ÐèÒªÉùÍû-Ê¦ÃÅ¹±Ï×¶È-¾ü¹¦
tb_wohucanglong_aword = {
				[73] = {0, 0, 0},
				[74] = {0, 0, 0},
				[75] = {6000, 6000, 15000},
				[76] = {6000, 6000, 50000},
				[77] = {7000, 7000, 50000},
				[78] = {7000, 7000, 50000},
				[79] = {8000, 8000, 60000},
				[80] = {8000, 8000, 60000},
				[81] = {9000, 9000, 70000},
				[82] = {9000, 9000, 70000},
				[83] = {10000, 10000, 80000},
				[84] = {10000, 10000, 80000}
};
--ÎÔ»¢²ØÁúÎïÆ·½±Àø£ºÎïÆ·Ãû£¬Ìí¼Ó²ÎÊý,Õâ¸ö½±Àø¶ÔÖ»½±ÀøÒ»¸öÎïÆ·¶øÇÒ²»·ÖÌåÐÎºÍÁ÷ÅÉµÄ
tb_wohucanglong_item_aword = {
				[73] = {"Nh©n S©m V¹n N¨m", {2, 1, 30071, 1}},
				[76] = {"Tói Hµnh Trang", {2, 1, 30072, 1}},
				[77] = {"R­¬ng BÝ KÝp", {2, 1, 30093, 1}},
				[80] = {"Tói Hµnh Trang", {2, 1, 30072, 1}},
				[84] = {"Thiªn Th¹ch linh th¹ch", {2, 1, 1068, 1}}
};
--ÎÔ»¢²ØÁú74¼¶½±Àø
tb_wohucanglong_item_aword_74 = {
				{"Trang Chñ m·o", {0, 103, 91, 1,1,-1,-1,-1,-1,-1,-1}},
				{"Trang Chñ m·o", {0, 103, 92, 1,1,-1,-1,-1,-1,-1,-1}},
				{"Trang Chñ m·o", {0, 103, 93, 1,1,-1,-1,-1,-1,-1,-1}},
				{"Trang Chñ m·o", {0, 103, 94, 1,1,-1,-1,-1,-1,-1,-1}}
};
--ÎÔ»¢²ØÁú75¼¶½±Àø
tb_wohucanglong_item_aword_75 = {
	[2] = {{"ChiÕn ý kh¶i gi¸p", {0, 100, 221, 1,1,-1,-1,-1,-1,-1,-1}}, {"ChiÕn ý kh¶i gi¸p", {0, 100, 222, 1,1,-1,-1,-1,-1,-1,-1}}},
	[3] = {{"ThiÒn TÞnh bµo", {0, 100, 321, 1,1,-1,-1,-1,-1,-1,-1}}, {"ThiÒn TÞnh bµo", {0, 100, 322, 1,1,-1,-1,-1,-1,-1,-1}}},
	[4] = {{"§Èu KhÝ ChiÕn y", {0, 100, 421, 1,1,-1,-1,-1,-1,-1,-1}}, {"§Èu KhÝ ChiÕn y", {0, 100, 422, 1,1,-1,-1,-1,-1,-1,-1}}},
	[6] = {{"BÝ §éc y", {0, 100, 621, 1,1,-1,-1,-1,-1,-1,-1}}, {"BÝ §éc y", {0, 100, 622, 1,1,-1,-1,-1,-1,-1,-1}}, {"BÝ §éc y", {0, 100, 623, 1,1,-1,-1,-1,-1,-1,-1}}, {"BÝ §éc y", {0, 100, 624, 1,1,-1,-1,-1,-1,-1,-1}}},
	[8] = {{}, {}, {"Ph¸p V©n y", {0, 100, 821, 1,1,-1,-1,-1,-1,-1,-1}}, {"Ph¸p V©n y", {0, 100, 822, 1,1,-1,-1,-1,-1,-1,-1}}},
	[9] = {{}, {}, {"Ph¸p ¢m y", {0, 100, 921, 1,1,-1,-1,-1,-1,-1,-1}}, {"Ph¸p ¢m y", {0, 100, 922, 1,1,-1,-1,-1,-1,-1,-1}}},
	[11] = {{"Tø H¶i y", {0, 100, 1121, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tø H¶i y", {0, 100, 1122, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tø H¶i y", {0, 100, 1123, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tø H¶i y", {0, 100, 1124, 1,1,-1,-1,-1,-1,-1,-1}}},
	[12] = {{"Tô NghÜa Th­êng", {0, 100, 1221, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tô NghÜa Th­êng", {0, 100, 1222, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tô NghÜa Th­êng", {0, 100, 1223, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tô NghÜa Th­êng", {0, 100, 1224, 1,1,-1,-1,-1,-1,-1,-1}}},
	[14] = {{"Tø T­îng ph¸p bµo", {0, 100, 1421, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tø T­îng ph¸p bµo", {0, 100, 1422, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tø T­îng ph¸p bµo", {0, 100, 1423, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tø T­îng ph¸p bµo", {0, 100, 1424, 1,1,-1,-1,-1,-1,-1,-1}}},
	[15] = {{"Linh Phong phôc", {0, 100, 1521, 1,1,-1,-1,-1,-1,-1,-1}}, {"Linh Phong phôc", {0, 100, 1522, 1,1,-1,-1,-1,-1,-1,-1}}, {"Linh Phong phôc", {0, 100, 1523, 1,1,-1,-1,-1,-1,-1,-1}}, {"Linh Phong phôc", {0, 100, 1524, 1,1,-1,-1,-1,-1,-1,-1}}},
	[17] = {{"Tinh Kh¶i gi¸p", {0, 100, 1721, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tinh Kh¶i gi¸p", {0, 100, 1722, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tinh Kh¶i gi¸p", {0, 100, 1723, 1,1,-1,-1,-1,-1,-1,-1}}, {"Tinh Kh¶i gi¸p", {0, 100, 1724, 1,1,-1,-1,-1,-1,-1,-1}}},
	[18] = {{"PhÊn Uy T­íng Qu©n kh¶i gi¸p", {0, 100, 1821, 1,1,-1,-1,-1,-1,-1,-1}}, {"PhÊn Uy T­íng Qu©n kh¶i gi¸p", {0, 100, 1822, 1,1,-1,-1,-1,-1,-1,-1}}, {"PhÊn Uy T­íng Qu©n kh¶i gi¸p", {0, 100, 1823, 1,1,-1,-1,-1,-1,-1,-1}}, {"PhÊn Uy T­íng Qu©n kh¶i gi¸p", {0, 100, 1824, 1,1,-1,-1,-1,-1,-1,-1}}},
	[20] = {{"H¾c V« Th­êng M·nh §éc y", {0, 100, 2021, 1,1,-1,-1,-1,-1,-1,-1}}, {"H¾c V« Th­êng M·nh §éc y", {0, 100, 2022, 1,1,-1,-1,-1,-1,-1,-1}}, {"H¾c V« Th­êng M·nh §éc y", {0, 100, 2023, 1,1,-1,-1,-1,-1,-1,-1}}, {"H¾c V« Th­êng M·nh §éc y", {0, 100, 2024, 1,1,-1,-1,-1,-1,-1,-1}}},
	[21] = {{"B¹ch V« Th­êng Ngôy §éc Y", {0, 100, 2121, 1,1,-1,-1,-1,-1,-1,-1}}, {"B¹ch V« Th­êng Ngôy §éc Y", {0, 100, 2122, 1,1,-1,-1,-1,-1,-1,-1}}, {"B¹ch V« Th­êng Ngôy §éc Y", {0, 100, 2123, 1,1,-1,-1,-1,-1,-1,-1}}, {"B¹ch V« Th­êng Ngôy §éc Y", {0, 100, 2124, 1,1,-1,-1,-1,-1,-1,-1}}}
};

--ÎÔ»¢²ØÁú78¼¶½±Àø
tb_wohucanglong_item_aword_78 = {
	[2] = {"Tói bÝ kiÕp ThiÕu L©m", {2, 0, 607, 1}},
	[3] = {"Tói bÝ kiÕp ThiÕu L©m", {2, 0, 607, 1}},
	[4] = {"Tói bÝ kiÕp ThiÕu L©m", {2, 0, 607, 1}},
	[6] = {"Tói bÝ kiÕp §­êng M«n", {2, 0, 608, 1}},
	[8] = {"Tói bÝ kiÕp Nga My", {2, 0, 609, 1}},
	[9] = {"Tói bÝ kiÕp Nga My", {2, 0, 609, 1}},
	[11] = {"Tói bÝ kiÕp C¸i Bang", {2, 0, 610, 1}},
	[12] = {"Tói bÝ kiÕp C¸i Bang", {2, 0, 610, 1}},
	[14] = {"Tói bÝ kiÕp Vâ §ang", {2, 0, 611, 1}},
	[15] = {"Tói bÝ kiÕp Vâ §ang", {2, 0, 611, 1}},
	[17] = {"Tói bÝ kiÕp D­¬ng M«n", {2, 0, 612, 1}},
	[18] = {"Tói bÝ kiÕp D­¬ng M«n", {2, 0, 612, 1}},
	[20] = {"Tói bÝ kiÕp Ngò §éc", {2, 0, 613, 1}},
	[21] = {"Tói bÝ kiÕp Ngò §éc", {2, 0, 613, 1}}
};

--ÎÔ»¢²ØÁú79¼¶½±Àø
tb_wohucanglong_item_aword_79 = {
	{"Th¸i H­ HuyÔn Ngäc (søc m¹nh)", 15, {0, 102, 29, 1, 1, -1, -1, -1, -1, -1, -1}},
	{"Th¸i H­ HuyÔn §¸i (th©n ph¸p)", 15, {0, 102, 30, 1, 1, -1, -1, -1, -1, -1, -1}},
	{"Th¸i H­ HuyÔn Hoµn (g©n cèt)", 14, {0, 102, 31, 1, 1, -1, -1, -1, -1, -1, -1}},
	{"Th¸i H­ HuyÔn Béi (néi c«ng)", 14, {0, 102, 32, 1, 1, -1, -1, -1, -1, -1, -1}},
	{"Th¸i H­ HuyÔn Giíi (Linh ho¹t)", 14, {0, 102, 33, 1, 1, -1, -1, -1, -1, -1, -1}},
	{"Th¸i H­ HuyÔn §¹i (®éc)", 14, {0, 102, 34, 1, 1, -1, -1, -1, -1, -1, -1}},
	{"Th¸i H­ HuyÔn Th¹ch (s¸t th­¬ng)", 14, {0, 102, 35, 1, 1, -1, -1, -1, -1, -1, -1}}
};

--ÎÔ»¢²ØÁú81¼¶½±Àø
tb_wohucanglong_item_aword_81 = {
	{"Tµng KiÕm ¤ kim phôc", {0, 101, 95, 1,1,-1,-1,-1,-1,-1,-1}},
	{"Tµng KiÕm ¤ kim phôc", {0, 101, 96, 1,1,-1,-1,-1,-1,-1,-1}},
	{"Tµng KiÕm ¤ kim phôc", {0, 101, 97, 1,1,-1,-1,-1,-1,-1,-1}},
	{"Tµng KiÕm ¤ kim phôc", {0, 101, 98, 1,1,-1,-1,-1,-1,-1,-1}}
};

--ÎÔ»¢²ØÁú82¼¶½±Àø
tb_wohucanglong_item_aword_82_1 = {
				{"DÞch C©n Kinh-th­îng", {2, 1, 916, 1}},
				{"Nh­ Lai ThÇn Ch­ëng-th­îng", {2, 1, 919, 1}},
				{"TÈy Tñy Kinh-th­îng", {2, 1, 922, 1}},
				{"HÊp Tinh TrËn-th­îng", {2, 1, 925, 1}},
				{"V¹n T­íng ThÇn C«ng-th­îng", {2, 1, 928, 1}},
				{"Thiªn ¢m TrÊn Hån Khóc-th­îng", {2, 1, 931, 1}},
				{"Gi¸ng Long ThËp B¸t Ch­ëng-th­îng", {2, 1, 934, 1}},
				{"§¶ CÈu C«n TrËn-th­îng", {2, 1, 937, 1}},
				{"V« Th­îng Th¸i Cùc KiÕm-th­îng", {2, 1, 940, 1}},
				{"Th¸i Cùc ThÇn C«ng-th­îng", {2, 1, 943, 1}},
				{"Liªn Hoµn Toµn Long Th­¬ng-th­îng", {2, 1, 946, 1}},
				{"B¸ V­¬ng T­êng Phông TiÔn-th­îng", {2, 1, 949, 1}},
				{"V« ¶nh Ma Cæ-th­îng", {2, 1, 952, 1}},
				{"V« Thiªn Ma C«ng-th­îng", {2, 1, 955, 1}}
	
};

tb_wohucanglong_item_aword_82_2 = {
				{"DÞch C©n Kinh-trung", {2, 1, 917, 1}},
				{"Nh­ Lai ThÇn Ch­ëng-trung", {2, 1, 920, 1}},
				{"TÈy Tñy Kinh-trung", {2, 1, 923, 1}},
				{"HÊp Tinh TrËn-trung", {2, 1, 926, 1}},
				{"V¹n T­íng ThÇn C«ng-trung", {2, 1, 929, 1}},
				{"Thiªn ¢m TrÊn Hån Khóc-trung", {2, 1, 932, 1}},
				{"Gi¸ng Long ThËp B¸t Ch­ëng-trung", {2, 1, 935, 1}},
				{"§¶ CÈu C«n TrËn-trung", {2, 1, 938, 1}},
				{"V« Th­îng Th¸i Cùc KiÕm-trung", {2, 1, 941, 1}},
				{"Th¸i Cùc ThÇn C«ng-trung", {2, 1, 944, 1}},
				{"Liªn Hoµn Toµn Long Th­¬ng-trung", {2, 1, 947, 1}},
				{"B¸ V­¬ng T­êng Phông TiÔn-trung", {2, 1, 950, 1}},
				{"V« ¶nh Ma Cæ-trung", {2, 1, 953, 1}},
				{"V« Thiªn Ma C«ng-trung", {2, 1, 956, 1}}
};

tb_wohucanglong_item_aword_82_3 = {
				{"DÞch C©n Kinh-h¹ ", {2, 1, 918, 1}},
				{"Nh­ Lai ThÇn Ch­ëng-h¹ ", {2, 1, 921, 1}},
				{"TÈy Tñy Kinh-h¹ ", {2, 1, 924, 1}},
				{"HÊp Tinh TrËn-h¹ ", {2, 1, 927, 1}},
				{"V¹n T­íng ThÇn C«ng-h¹ ", {2, 1, 930, 1}},
				{"Thiªn ¢m TrÊn Hån Khóc-h¹ ", {2, 1, 933, 1}},
				{"Gi¸ng Long ThËp B¸t Ch­ëng-h¹ ", {2, 1, 936, 1}},
				{"§¶ CÈu C«n TrËn-h¹ ", {2, 1, 939, 1}},
				{"V« Th­îng Th¸i Cùc KiÕm-h¹ ", {2, 1, 942, 1}},
				{"Th¸i Cùc ThÇn C«ng-h¹ ", {2, 1, 945, 1}},
				{"Liªn Hoµn Toµn Long Th­¬ng-h¹ ", {2, 1, 948, 1}},
				{"B¸ V­¬ng T­êng Phông TiÔn-h¹ ", {2, 1, 951, 1}},
				{"V« ¶nh Ma Cæ-h¹ ", {2, 1, 954, 1}},
				{"V« Thiªn Ma C«ng-h¹ ", {2, 1, 957, 1}}
};

--ÎÔ»¢²ØÁú83¼¶½±Àø
tb_wohucanglong_item_aword_83 = {
	[2]  = {"Ph¸ Yªn ®ao", {0, 3, 6001, 1,1,-1,-1,-1,-1,-1,-1}},
	[3]  = {"Phï Yªn tr­îng",{0,8,6003, 1,1,-1,-1,-1,-1,-1,-1}},
	[4]  = {"Hµm Yªn thñ",{0,0,6004, 1,1,-1,-1,-1,-1,-1,-1}},
	[6]  = {"Tµng Yªn ch©m",{0,1,6005, 1,1,-1,-1,-1,-1,-1,-1}},
	[8]  = {"Phi Yªn kiÕm",{0,2,6006, 1,1,-1,-1,-1,-1,-1,-1}},
	[9]  = {"VËn Yªn cÇm",{0,10,6007, 1,1,-1,-1,-1,-1,-1,-1}},
	[11] = {"V©n Yªn thñ",{0,0,6008, 1,1,-1,-1,-1,-1,-1,-1}},
	[12] = {"L­u Yªn c«n",{0,5,6009, 1,1,-1,-1,-1,-1,-1,-1}},
	[14] = {"HuyÒn Yªn kiÕm",{0,2,6010, 1,1,-1,-1,-1,-1,-1,-1}},
	[15] = {"Vò Yªn bót",{0,9,6011, 1,1,-1,-1,-1,-1,-1,-1}},
	[17] = {"Hµ Tiªm Th­¬ng",{0,6,6012, 1,1,-1,-1,-1,-1,-1,-1}},
	[18] = {"Hµnh Yªn Cung",{0,4,6013, 1,1,-1,-1,-1,-1,-1,-1}},
	[20] = {"Träc Yªn nhÉn",{0,7,6014, 1,1,-1,-1,-1,-1,-1,-1}},
	[21] = {"Yªu Yªn tr¶o",{0,11,6015, 1,1,-1,-1,-1,-1,-1,-1}},
};

--10 ³Â¾ÉÃØ±¾ + 1 ¸´Ô­ÊõºÏ³É³¤ÉúÆÕ
function GetChangshengpu()
	if GetItemCount(2, 1, 30088) < 10 or GetItemCount(2, 1, 30089) == 0 then
		Talk(1, "", "Nguyªn liÖu trªn hµnh trang kh«ng ®ñ ®æi 1 Tr­êng Sinh Phæ, hay lµ quªn t¹i hßm ®å råi?");
		return
	end
	if gf_Judge_Room_Weight(1, 10, " ") == 0 then
		return
	end
	if DelItem(2, 1, 30088, 10) == 1 and DelItem(2, 1, 30089, 1) == 1 then
		gf_SetLogCaption("Truy t×m tr­êng sinh phæ");
		gf_AddItemEx({2, 1, 30090, 1}, "Tr­êng Sinh Phæ ");
		gf_SetLogCaption("");
	end
end

function VerifyDate(nType)
	local nCurDate = tonumber(date("%y%m%d%H"))
	local nRet = 0		
	if EVENT_DATE_START <= nCurDate and nCurDate <= EVENT_DATE_END[nType] then
		nRet = 1
	end	
	return nRet
end

