-- filename：s2map_ask.lua
-- By:Xsjcs
-- 帮助玩家查询练级地点
---------------------------------------------
lv_str = {	"新手","五级以上","刚过十级","十多级","刚过二十级","二十多级","刚过三十级","三十多级","刚过四十级","四十多级","五十级高手","绝顶高手"}
dangernpc = {	"白兔,灰兔","流氓,无赖","小土狼,小青狼,铁甲虫","野猪,大黄蜂,百日箭","小偷,蝙蝠,马猴,剑客","飞贼,刀侠,老虎","女剑客,雪怪","饿狼,矮汉,黑鸦,蜘蛛,女剑侠,泼妇河东狮,木人,恶吏","妖狐,山贼,名枪侠,剑煞,吸血蝙蝠,眼镜蛇,刀绝,千里镖,剑狂,铜人,剑绝,刀客","地杀,幻武刀者,持弓猎户,女剑豪,辽箭兵,捕快,辽刀兵,宋弩兵,宋刀兵","天杀,宋枪兵,冰怪,机关木人,密探,辽枪兵,持叉猎户,荡刀客,幻武剑者,荒漠刀客","高手名宿级的人物,如剑邪,枪狂等人"}
helpmap = {	"成都各个城郊、汴京各个城郊",
		"成都各个城郊较远的地方、汴京各个城郊较远的地方",
		"成都府南较远的地方、汴京府东较远的地方、杏花村、丐帮附近、峨嵋附近",
		"少林附近，峨嵋附近、武当附近，伏牛山山下、杏花村郊外",
		"各大门派附近",
		"各大门派附近",
		"各大门派附近、冰心洞一层",
		"祥云洞、阳中洞二层左侧、青城山山下、七星洞一层、少林密室一层、冰心洞一层",
		"祥云洞、阳中洞一层和二层、七星洞一层、少林密室一层、冰心洞一层、竹丝洞一层、梁山泊",
		"阳中洞三层、七星洞二层、少林密室二层、金光洞、剑门关、雁门关",
		"金光洞、阳中洞、少林密室二层、金光洞、二龙山，剑门关、雁门关",
		"各地的神秘洞窟、山寨、秘道，峡谷"
	}

function maphp()
	lvl = floor(GetLevel()/5 + 1)
	if (lvl>12) then 
		lvl=12;
	end;
	Talk(3,"","<color=green>城门卫兵<color>：对于<color=red>"..lv_str[lvl].."的您<color>来说，当前适合的练级地方是<color=red>“"..helpmap[lvl].."”<color>等地点。<enter>在这些区域，比较适合您打的是<color=red>"..dangernpc[lvl].."<color>等，对您当前等级而言他们应该可以独立解决。","<color=green>城门卫兵<color>：虽然您有能力单独练级，但是我们仍然<color=red>强烈建议<color>您和朋友一起组队练级，这样会更为安全和快捷。快去吧！","<color=green>城门卫兵<color>：<color=red>请务必注意<color>：由于每个练级地都有高低级怪物混杂，对于有<color=red>警戒色<color>的怪物，如<color=red>红色<color>、<color=blue>蓝色<color>和<color=yellow>黄色<color>的怪物，建议您不要单独前往，此外当怪物给您提供的经验开始下降时，怪物的名字颜色会变为灰色。<enter>如果您装备有<color=red>五行武器<color>而且等级在<color=red>40<color>级以上，并且完成了相关任务的话，可以尝试前往<color=green>丰都<color>、<color=green>江津村<color>这两个特殊地方练级。这些区域分布有<color=red>阴<color>属性怪物。")
end;