-- ====================== 文件信息 ====================== 
                                                          
-- 剑侠情缘onlineII 一等杀手包裹脚本                  
-- Edited by Starry                                 
-- 2005/12/5 PM 14:09                                    
                                                          
-- ======================================================
function OnUse()

local i = 0;
local j = 0;
local k = 0; 
local nCount = 0;
local nLuckyNum = 0;
local nNum = 0; 

	DelItem(2,1,205,1,1);
	
	--100%出高级药品:3个九转
	--AddItem(1,0,32,3,1);
	
	--50%出金锡
	if random(1,100) <= 50 then
		AddItem(2,1,149,1,1);
	end;
	
	--50%出陨铁
	if random(1,100) <= 50 then
		AddItem(2,2,8,1,1);
	end;
	
	--50%出陨铁碎片
	if random(1,100) <= 50 then
		AddItem(2,2,7,1,1);
	end;
		
	--50%出小块金锡
	if random(1,100) <= 50 then
		AddItem(2,1,148,1,1);
	end;
	
	--14%出神秘物品
	if random(1,100) <= 14 then
		local m = random(1,getn(SecretItem));
			AddItem(SecretItem[m][1],SecretItem[m][2],SecretItem[m][3],1,1);
	end; 
	
	--7.4%出套装帽子
	nNum = random(1,1000);
	
	if nNum <= 74 then
	local nRoute = GetPlayerRoute();
	local nbody = GetBody()

		AddItem(SuitData[nRoute][nbody][1],SuitData[nRoute][nbody][2],SuitData[nRoute][nbody][3],1,1,-1,-1,-1,-1,-1,-1);
	
		return
	end;
		
	--12.9%出定制装备
	if nNum <= 203 then
	
		for i=1,getn(KillerBagData) do
			nCount = nCount + KillerBagData[i][1];
		end;
		
		nLuckyNum = random(1,nCount);
		nCount = 0;
		
		for i=1,getn(KillerBagData) do
			nCount = nCount + KillerBagData[i][1];
			if nCount>=nLuckyNum then
				k = getn(KillerBagData[i]);
				j = random(2,k);
				return AddItem(KillerBagData[i][j][1],KillerBagData[i][j][2],KillerBagData[i][j][3],KillerBagData[i][j][4],KillerBagData[i][j][5],KillerBagData[i][j][6],KillerBagData[i][j][7],KillerBagData[i][j][8],KillerBagData[i][j][9],KillerBagData[i][j][10],KillerBagData[i][j][11]);					
			end;
		end;
	end;
	
end;

KillerBagData = {
	--5级护身,5级戒指:经验提高3%;
	[1] = {14,{0,102,5,1,1,2,99,0,0,0,0},{0,102,15,1,1,2,99,0,0,0,0}},
	--5级护身,5级戒指:减需求1
	[2] = {29,{0,102,5,1,1,2,109,0,0,0,0},{0,102,15,1,1,2,109,0,0,0,0}},
	--70级武器,5级护身,5级戒指:力量13	根骨13	身法13;内功13	根骨13	洞察13;洞察13	身法13	根骨13
	[3] = {51,{0,102,5,1,1,5,95,5,94,5,96},
						{0,102,15,1,1,5,95,5,94,5,96},
						{0,102,5,1,1,5,98,5,94,5,97},
						{0,102,15,1,1,5,98,5,94,5,97},
						{0,102,5,1,1,5,97,5,96,5,94},
						{0,102,15,1,1,5,97,5,96,5,94},
						{0,0,13,1,1,3,86,5,98,4,64},
						{0,2,26,1,1,3,86,5,98,4,64},
						{0,0,13,1,1,3,85,5,95,4,63},
						{0,1,52,1,1,3,85,5,96,4,63},
						{0,9,85,1,1,3,85,5,97,4,63},
						{0,2,26,1,1,6,42,5,98,2,99},
						{0,10,74,1,1,3,86,5,98,4,64},
						{0,8,96,1,1,3,86,5,98,4,64},
						{0,5,39,1,1,3,85,5,95,4,63},
						{0,3,63,1,1,3,85,5,95,4,63},
						{0,6,107,1,1,3,85,5,95,4,63},
						{0,4,118,1,1,3,85,5,96,4,63},
						{0,11,11,1,1,3,86,5,98,4,64},
						{0,7,11,1,1,3,85,5,96,4,63},
						}
}

SuitData = {

	--金刚之逍遥冠(少林俗家)
	[2] = {{0,103,271},{0,103,272}},
	--如来之逍遥冠(少林禅宗)
	[3] = {{0,103,371},{0,103,372}},
	--罗汉之逍遥冠(少林武宗)
	[4] = {{0,103,471},{0,103,472}},
	--侠客之逍遥冠(唐门)
	[6] = {{0,103,671},{0,103,672},{0,103,673},{0,103,674}},
	--观音之逍遥冠(峨嵋佛家)
	[8] = {{},{},{0,103,873},{0,103,874}},
	--玉女之逍遥冠(峨嵋俗家)
	[9] = {{},{},{0,103,973},{0,103,974}}, 
	--降龙之逍遥冠(丐帮净衣)
	[11] = {{0,103,1171},{0,103,1172},{0,103,1173},{0,103,1174}},
	--疯魔之逍遥冠(丐帮污衣)
	[12] = {{0,103,1271},{0,103,1272},{0,103,1273},{0,103,1274}},
	--真武之逍遥冠(武当道家)
	[14] = {{0,103,1471},{0,103,1472},{0,103,1473},{0,103,1474}},
	--一阳之逍遥冠(武当俗家)
	[15] = {{0,103,1571},{0,103,1572},{0,103,1573},{0,103,1574}},
	--车骑之将军冠(杨门枪骑)
	[17] = {{0,103,1771},{0,103,1772},{0,103,1773},{0,103,1774}},
	--扬威之安邦冠(杨门弓骑)
	[18] = {{0,103,1871},{0,103,1872},{0,103,1873},{0,103,1874}},
	--幽冥之千钧冠(五毒邪侠)
	[20] = {{0,103,2071},{0,103,2072},{0,103,2073},{0,103,2074}},
	--苗门之蚀心冠(五毒蛊师)
	[21] = {{0,103,2171},{0,103,2172},{0,103,2173},{0,103,2174}},
}

SecretItem = {
	--龙骨
	[1] = {2,1,116},
	--尸王肋骨
	[2] = {2,1,118},
	--苍狼牙
	[3] = {2,1,113},
	--雷炎金沙
	[4] = {2,1,146},
	--防水油绸
	[5] = {2,1,114},
	--天衣无缝
	[6] = {2,1,147},
	--墨油
	[7] = {2,1,136},
	--染料
	[8] = {2,1,153},		
}
