function OnUse(nItemIndex)
	SendScript2Client("Open([[LargeMsg]], 1, [[hИp th╜ thгn bщ]]);");
	--Talk(1,"","<color=green>хн╫лжВё╨<color>\n   	дЦ╨цё║тзоб╫╜╠П╨вё╛╬цяЖдЗ╢СцШё╛╣цж╙╫лжВи╠кю╤Яд╖╤╚╥╫╡╩╟эё╛жьпб╤А╩ьхутбиЯ╫лё╛тзобй╣тз╦ъпкё╛╦пп╩╫лжВн╙нрцгуШ╦ЖнДаж╡ЫЁЩакуБ╦Ж╢Сд╖м╥ё╛нроЮпехутбиЯ╫лтзнД╧╕╦гйю║╒пш╡е╢Сбт╣д╫лжВ╢ЬаЛобё╛р╩╤╗╩Асют╤мЧуП╫╜╨Ч║ё\n 	тзоб╣цж╙м╗лЛ╩ц╬ЁюОспр╩╦ЖмР╫ёзёё╛юОцФсп╨э╤ЮфФуДрЛ╠╕ё╛грж╙╣юхн╫лжВтЬ╫ЬхК╧Щм╗лЛ╩ц╬Ёё╛рР╢к©ргК╫лжВ╨мнрр╩фП╢ЁмР╫ёзёё╛нроКхГ╧Шнрцг╢С╪рфКпдп╜а╕ё╛р╩╤╗дэ©╙фТмР╫ёзёюО╣д╥Бс║ё╛╣╫й╠╨Рр╩гп╠╕нО╫лжВ╤╪©иртдцвъё╛нр╩АлЩ╢с╫лжВ╣д╟╡ее║ёхГдэ╣ц╣╫╫лжВ╣доЮжЗё╛╫╚╩Айгнр╫╜╠П╨вр╩иЗ╣дхыпр║ё\n   фз╢ЩдэтГху╪Ш╣╫╫лжВё║\n                                                                    <color=green> ╫╜╠П╨в<color>")
	--SetItemUseLapse(nItemIndex,18*60*3);
end