Include("\\script\\lib\\globalfunctions.lua")
--²âÊÔ
DebugOutput = nothing

--ÊÇ·ñÎªÐÂ·þ·þÎñÆ÷
--Experience server Switch
CK_ES_SWITCH = 1;
EXT_CDKEY = 3	

--activity time
CK_START_TIME = {2014,10,21,0,0,0}; --¿ªÆôÊ±¼ä
CK_START_ACT = {2014,11,22,0,0,0}; --¼¤»î½ØÖ¹Ê±¼ä
CK_END_TIME = {2015,1,21,0,0,0}; --»î¶¯½ØÖ¹Ê±¼ä

--Ê¹ÓÃµÄÈÎÎñ±äÁ¿×é
CK_TASK_GROUP = {4, 13};

--ÓÂÍùÖ±Ç°ÏµÁÐÈÎÎñ
CK_TASK_FORWARD = {
	[1] = {"Tiªu diÖt ¸c Lang", 226},
	[2] = {"Tiªu diÖt Hå Ly", 227},
	[3] = {"Tiªu diÖt Xi Háa XÝch Gi¸o §å", 228},
	[4] = {"Tiªu diÖt Th­¬ng Viªn", 229},
	[5] = {"Tiªu diÖt Miªu LÜnh Thæ Ty", 230},
	[6] = {"Tiªu diÖt Ba T­ Yªu C¬", 231},
	[7] = {"Tiªu diÖt Oa Quèc §ao Kh¸ch", 232},
	[8] = {"Tiªu diÖt Tú Bµ Tiªn Tö", 233},
}

--°ÙÕ½²»´ùÉ±¹ÖÈÎÎñ
CK_TASK_BZ_KILL = {
	[1] = {"Quay VÒ Chèn Cò", 234},
	[2] = {"Quay VÒ Chèn Cò", 235},
	[3] = {"Quay VÒ Chèn Cò", 236},
	[4] = {"Quay VÒ Chèn Cò", 237},
	[5] = {"Quay VÒ Chèn Cò", 238},
}

--°ÙÕ½²»´ù¸±±¾ÈÎÎñ
CK_TASK_BZ_RAID = {
	[1] = "Tham gia 1 lÇn ¶i Th¸i H­",
	[2] = "Tham gia 1 lÇn ¶i L­¬ng S¬n ",
	[3] = "Tham gia 1 lÇn ¶i V¹n KiÕm Tròng",
	[4] = "Tham gia 1 lÇn ¶i §Þa HuyÒn Cung",
	[5] = "Tham gia 1 lÇn ¶i Th¸i NhÊt Th¸p",
}

--°ÙÕ½²»´ùPVPÈÎÎñ
CK_TASK_BZ_PVP = {
	[1] = "Tham gia 3 lÇn thi ®Êu 1v1",
	[2] = "Tham gia 3 lÇn thi ®Êu 3v3",
	[3] = "Tham gia 1 lÇn chiÕn tr­êng Thiªn M«n TrËn",
	[4] = "Tham gia 1 lÇn Th«n lµng chiÕn",
	[5] = "Tham gia 1 lÇn Th¶o cèc chiÕn",
	[6] = "Tham gia 1 lÇn Ph¸o ®µi chiÕn",
	[7] = "Tham gia 1 lÇn ChiÕn dÞch chÝnh Nh¹n M«n",	
}

--ÊýÖµÀÛ¼ÆÈÎÎñ
CK_TASK_ZILON_ATRR = {
	[1] = {"S¬ nhËp giang hå", {0, 90, 2000, 2000, 10000}, {5000000, 100}},
	[2] = {"TiÓu H÷u Së Thµnh", {0, 99, 3000, 3000, 20000}, {8000000, 200}},
	[3] = {"S¬ xuÊt mao l­", {1, 90, 6000, 6000, 40000}, {11000000, 300}},
	[4] = {"§¹i Lang §µo Sa", {2, 90, 8000, 8000, 80000}, {14000000, 400}},	
	[5] = {"TiÓu H÷u Danh KhÝ", {3, 90, 10000, 10000, 120000}, {17000000, 500}},
	[6] = {"Tr¸ng ChÝ L¨ng V©n", {4, 90, 12000, 12000, 180000}, {20000000, 600}},
	[7] = {"Uy Phong B¸t DiÖn", {5, 90, 15000, 15000, 250000}, {23000000, 1200}},
	[8] = {"KhÝ tr¸ng hµ s¬n", {6, 90, 16000, 16000, 280000}, {32000000, 1600}},
}
CK_TASK_ZILON_ATRR_BEGIN = 1

--Ìì½¾ÁîÏû·ÑÈÎÎñ
CK_TASK_IB_COST = {
	[1] = {"Phong Y Tóc Thùc", 5,   {12500000, 150}},
	[2] = {"Uy Phong B¸t DiÖn", 25,  {25000000, 300}},
	[3] = {"Kinh tÕ gia ®×nh", 50,  {37500000, 450}},	
	[4] = {"§¹i Phó §¹i Quý", 100, {50000000, 600}},
	[5] = {"Tµi §¹i KhÝ Th«", 200, {62500000, 800}},
	[6] = {"Gia Tµi V¹n Qu¸n", 300, {75000000, 1000}},
	[7] = {"Giµu cã thiªn h¹", 400, {100000000, 1200}},
	[8] = {"Phó Kh¶ §Þch Quèc", 500, {125000000, 1500}},
}
CK_TASK_IB_COST_BEGIN = getn(CK_TASK_ZILON_ATRR)+1

--¹±Ï×½±Àø
CK_SCROE_AWARD_TABLE = {
	[1] = 90,	
	[2] = 1000,
	[3] = 1300,
	[4] = 1700,
	[5] = 2000,
	[6] = 2400,
	[7] = 2800,
	[8] = 3100,
	[9] = 3500,
	[10] = 3800,
	[11] = 5000,
	[12] = 6000,
	[13] = 7000,
	[14] = 8500,
	[15] = 11000,
	[16] = 14000,
	[17] = 15000,
	[18] = 16000,
	[19] = 17000,
}

CK_JS_GUAIYI = {
	{"¸o Choµng Ngò Hµnh Kim ChÕ", {0, 152, 4, 1, 4}},
	{"¸o Choµng Ngò Hµnh Méc ChÕ", {0, 152, 5, 1, 4}},
	{"¸o Choµng Ngò Hµnh Thñy ChÕ", {0, 152, 6, 1, 4}},
	{"¸o Choµng Ngò Hµnh Háa ChÕ", {0, 152, 7, 1, 4}},
	{"¸o Choµng Ngò Hµnh Thæ ChÕ", {0, 152, 8, 1, 4}},
	{"¸o Choµng Ngò Hµnh ¢m ChÕ", {0, 152, 9, 1, 4}},
}
CK_JS_HUIZHANG = { 
	{"Huy Ch­¬ng Kim ChÕ ngò hµnh", {0, 153, 4, 1, 4}},
	{"Huy Ch­¬ng Méc ChÕ ngò hµnh", {0, 153, 5, 1, 4}},
	{"Huy Ch­¬ng Thñy ChÕ ngò hµnh", {0, 153, 6, 1, 4}},
	{"Huy Ch­¬ng Háa ChÕ ngò hµnh", {0, 153, 7, 1, 4}},
	{"Huy Ch­¬ng Thæ ChÕ ngò hµnh", {0, 153, 8, 1, 4}},
	{"Huy Ch­¬ng ¢m ChÕ ngò hµnh", {0, 153, 9, 1, 4}},
}
CK_JS_SHOE = {
	{"ChiÕn Hµi Kim ChÕ ngò hµnh", {0, 154, 4, 1, 4}},
	{"ChiÕn Hµi Méc ChÕ ngò hµnh", {0, 154, 5, 1, 4}},
	{"ChiÕn Hµi Thñy ChÕ ngò hµnh", {0, 154, 6, 1, 4}},
	{"ChiÕn Hµi Háa ChÕ ngò hµnh", {0, 154, 7, 1, 4}},
	{"ChiÕn Hµi Thæ ChÕ ngò hµnh", {0, 154, 8, 1, 4}},
	{"ChiÕn Hµi ¢m ChÕ ngò hµnh", {0, 154, 9, 1, 4}},
}

CK_YAOYANG_JIEZI_1 = {
	{"DiÖu D­¬ng-¤ L©n B¶o Giíi", {0, 102, 3176, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"DiÖu D­¬ng-Tö Giao Ngäc Béi", {0, 102, 3178, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"DiÖu D­¬ng-V©n Hæ LÖnh", {0, 102, 3180, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"DiÖu D­¬ng-XÝch T­íc Hoµn", {0, 102, 3182, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"DiÖu D­¬ng-BÝch Quy Liªn", {0, 102, 3184, 1, 4, -1, -1, -1, -1, -1, -1}},
}

CK_YAOYANG_JIEZI_2 = {
	{"DiÖu D­¬ng-¤ L©n B¶o Giíi", {0, 102, 3185, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"DiÖu D­¬ng-Tö Giao Ngäc Béi", {0, 102, 3186, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"DiÖu D­¬ng-V©n Hæ LÖnh", {0, 102, 3187, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"DiÖu D­¬ng-XÝch T­íc Hoµn", {0, 102, 3188, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"DiÖu D­¬ng-BÝch Quy Liªn", {0, 102, 3189, 1, 4, -1, -1, -1, -1, -1, -1}},
}

CK_4_LEVEL_YUNLING = {
	{"H-LiÖt Nham-Lv4", {0, 148, 53, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Ph¸ Kh«ng-Lv4", {0, 148, 54, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Tóy KiÕm-Lv4", {0, 148, 55, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-TËt Phong-Lv4", {0, 148, 56, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-TÊn Vò-Lv4", {0, 148, 57, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-¦ng TËp-Lv4", {0, 148, 58, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Linh T©m-Lv4", {0, 148, 59, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-ThÇn Lùc-Lv4", {0, 148, 60, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Ng­ng ThÇn-Lv4", {0, 148, 61, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-V« Gian-Lv4", {0, 148, 62, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-V« Cùc-Lv4", {0, 148, 63, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Cuång NhÉn-Lv4", {0, 148, 64, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-L¨ng NhuÖ-Lv4", {0, 148, 65, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Linh Viªn-Lv4", {0, 148, 66, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-H¶i VËn-Lv4", {0, 148, 67, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-H¶i T©m-Lv4", {0, 148, 68, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-LiÖt Nham-Lv4", {0, 149, 53, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Ph¸ Kh«ng-Lv4", {0, 149, 54, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Tóy KiÕm-Lv4", {0, 149, 55, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-TËt Phong-Lv4", {0, 149, 56, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-TÊn Vò-Lv4", {0, 149, 57, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Qu¸n Th¹ch-Lv4", {0, 149, 58, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Né Ng©m-Lv4", {0, 149, 59, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Xuyªn V©n-Lv4", {0, 149, 60, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-ThÇn Lùc-Lv4", {0, 149, 61, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Ng­ng ThÇn-Lv4", {0, 149, 62, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-V« Gian-Lv4", {0, 149, 63, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-V« Cùc-Lv4", {0, 149, 64, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Cuång NhÉn-Lv4", {0, 149, 65, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-L¨ng NhuÖ-Lv4", {0, 149, 66, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Linh Viªn-Lv4", {0, 149, 67, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-H¶i VËn-Lv4", {0, 149, 68, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-H¶i T©m-Lv4", {0, 149, 69, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-LiÖt Nham-Lv4", {0, 150, 53, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Ph¸ Kh«ng-Lv4", {0, 150, 54, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Tóy KiÕm-Lv4", {0, 150, 55, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-TËt Phong-Lv4", {0, 150, 56, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-TÊn Vò-Lv4", {0, 150, 57, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-V« L­îng-Lv4", {0, 150, 58, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Môc Minh-Lv4", {0, 150, 59, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-ThÇn Lùc-Lv4", {0, 150, 60, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Ng­ng ThÇn-Lv4", {0, 150, 61, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-V« Gian-Lv4", {0, 150, 62, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-V« Cùc-Lv4", {0, 150, 63, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Cuång NhÉn-Lv4", {0, 150, 64, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-L¨ng NhuÖ-Lv4", {0, 150, 65, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Linh Viªn-Lv4", {0, 150, 66, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-H¶i VËn-Lv4", {0, 150, 67, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-H¶i T©m-Lv4", {0, 150, 68, 1, 4, -1, -1, -1, -1, -1, -1}},
}

CK_5_LEVEL_YUNLING = {
	{"H-LiÖt Nham-Lv5", {0, 148, 69, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Ph¸ Kh«ng-Lv5", {0, 148, 70, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Tóy KiÕm-Lv5", {0, 148, 71, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-TËt Phong-Lv5", {0, 148, 72, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-TÊn Vò-Lv5", {0, 148, 73, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-¦ng TËp-Lv5", {0, 148, 74, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Linh T©m-Lv5", {0, 148, 75, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-ThÇn Lùc-Lv5", {0, 148, 76, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Ng­ng ThÇn-Lv5", {0, 148, 77, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-V« Gian-Lv5", {0, 148, 78, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-V« Cùc-Lv5", {0, 148, 79, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Cuång NhÉn-Lv5", {0, 148, 80, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-L¨ng NhuÖ-Lv5", {0, 148, 81, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-Linh Viªn-Lv5", {0, 148, 82, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-H¶i VËn-Lv5", {0, 148, 83, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"H-H¶i T©m-Lv5", {0, 148, 84, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-LiÖt Nham-Lv5", {0, 149, 70, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Ph¸ Kh«ng-Lv5", {0, 149, 71, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Tóy KiÕm-Lv5", {0, 149, 72, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-TËt Phong-Lv5", {0, 149, 73, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-TÊn Vò-Lv5", {0, 149, 74, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Qu¸n Th¹ch-Lv5", {0, 149, 75, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Né Ng©m-Lv5", {0, 149, 76, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Xuyªn V©n-Lv5", {0, 149, 77, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-ThÇn Lùc-Lv5", {0, 149, 78, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Ng­ng ThÇn-Lv5", {0, 149, 79, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-V« Gian-Lv5", {0, 149, 80, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-V« Cùc-Lv5", {0, 149, 81, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Cuång NhÉn-Lv5", {0, 149, 82, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-L¨ng NhuÖ-Lv5", {0, 149, 83, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-Linh Viªn-Lv5", {0, 149, 84, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-H¶i VËn-Lv5", {0, 149, 85, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"C-H¶i T©m-Lv5", {0, 149, 86, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-LiÖt Nham-Lv5", {0, 150, 69, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Ph¸ Kh«ng-Lv5", {0, 150, 70, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Tóy KiÕm-Lv5", {0, 150, 71, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-TËt Phong-Lv5", {0, 150, 72, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-TÊn Vò-Lv5", {0, 150, 73, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-V« L­îng-Lv5", {0, 150, 74, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Môc Minh-Lv5", {0, 150, 75, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-ThÇn Lùc-Lv5", {0, 150, 76, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Ng­ng ThÇn-Lv5", {0, 150, 77, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-V« Gian-Lv5", {0, 150, 78, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-V« Cùc-Lv5", {0, 150, 79, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Cuång NhÉn-Lv5", {0, 150, 80, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-L¨ng NhuÖ-Lv5", {0, 150, 81, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-Linh Viªn-Lv5", {0, 150, 82, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-H¶i VËn-Lv5", {0, 150, 83, 1, 4, -1, -1, -1, -1, -1, -1}},
	{"T-H¶i T©m-Lv5", {0, 150, 84, 1, 4, -1, -1, -1, -1, -1, -1}},
}

function ck_GiveRandGem456()
	--Faction Cloth 9
	local VET_RandGem456 = {
        {1,20, "HuyÕtTrÝchTh¹ch Lv4", {2,22,104,1},nil,nil,nil,nil},
        {1,20, "NguyÖtB¹chTh¹ch Lv4", {2,22,204,1},nil,nil,nil,nil},
        {1,20, "Hæ Ph¸ch Th¹ch CÊp 4", {2,22,304,1},nil,nil,nil,nil},
        {1,20, "H¾c DiÖu Th¹ch CÊp 4", {2,22,404,1},nil,nil,nil,nil},
        {1,4, "HuyÕtTrÝchTh¹ch Lv5", {2,22,105,1},nil,nil,nil,1},
        {1,4, "NguyÖtB¹chTh¹ch Lv5", {2,22,205,1},nil,nil,nil,1},
        {1,4, "Hæ Ph¸ch Th¹ch CÊp 5", {2,22,305,1},nil,nil,nil,1},
        {1,4, "H¾c DiÖu Th¹ch CÊp 5", {2,22,405,1},nil,nil,nil,1},
        {1,1, "HuyÕtTrÝchTh¹ch Lv6", {2,22,106,1},nil,nil,nil,1},
        {1,1, "NguyÖtB¹chTh¹ch Lv6", {2,22,206,1},nil,nil,nil,1},
        {1,1, "Hæ Ph¸ch Th¹ch CÊp 6", {2,22,306,1},nil,nil,nil,1},
        {1,1, "H¾c DiÖu Th¹ch CÊp 6", {2,22,406,1},nil,nil,nil,1},
	} 
	gf_EventGiveRandAward(VET_RandGem456,100,1, "CDKEY", "CDKEY")
end

ck_tb_translife_tittle = 
{
	[1] = 	{
				[2] = {"Hçn Nguyªn T¨ng", 24, 1},	
				[4] = {"§Êu T¨ng", 24, 2},	
				[3] = {"ThiÒn Tu T¨ng", 24, 3},	
				[6] = {"Hé VÖ", 24, 4},	
				[8] = {"Vò Y Sø", 24, 5},	
				[9] = {"Ph¹n ¢m Sø", 24, 6},	
				[11] = {"Trõ Gian §Ö Tö", 24, 7},	
				[12] = {"Trõng ¸c §Ö Tö", 24, 8},	
				[14] = {"NhËp Quan ®¹o nh©n", 24, 9},	
				[15] = {"S¬n D­¬ng ®¹o nh©n", 24, 10},	
				[17] = {"HiÖu óy", 24, 11},	
				[18] = {"§« óy", 24, 12},	
				[20] = {"Th«i MÖnh T¶n Nh©n", 24, 13},	
				[21] = {"Thùc T©m T¶n Nh©n", 24, 14},
				[23] = {"NhËp Quan ®¹o nh©n", 24, 9},	
				[29] = {"Vò Y Sø", 24, 5},	
				[30] = {"Ph¹n ¢m Sø", 24, 6},					
			},
			
	[2] = 	{
				[2] = {"§¹t Ma Kim Cang", 25, 1},	
				[4] = {"La H¸n Hé Ph¸p", 25, 2},	
				[3] = {"TruyÒn kinh ph¸p s­", 25, 3},	
				[6] = {"BÝ ®éc thÝch kh¸ch", 25, 4},	
				[8] = {"Tö Tróc sø", 25, 5},	
				[9] = {"H¶i NguyÖt sø", 25, 6},	
				[11] = {"Tø H¶i hiÖp", 25, 7},	
				[12] = {"§Ö tö t¸m tói", 25, 8},	
				[14] = {"V« ng· ®¹o nh©n", 25, 9},	
				[15] = {"Nhµn V©n HiÖp §¹o", 25, 10},	
				[17] = {"PhÊn vò t­íng qu©n", 25, 11},	
				[18] = {"PhÊn uy t­íng qu©n", 25, 12},	
				[20] = {"H¾c V« Th­êng", 25, 13},	
				[21] = {"B¹ch V« Th­êng", 25, 14},
				[23] = {"V« ng· ®¹o nh©n", 25, 9},		
				[29] = {"Tö Tróc sø", 25, 5},	
				[30] = {"H¶i NguyÖt sø", 25, 6},							
			},
			
	[3] =	{		
				[2] = {"B¸t Bé Thiªn Long", 26, 1},	
				[4] = {"B¸t B¶o La H¸n", 26, 2},	
				[3] = {"V« L­îng Ph¸p T«n", 26, 3},	
				[6] = {"Thiªn C¬ Sø Gi¶", 26, 4},	
				[8] = {"B¹ch Liªn Tiªn Tö", 26, 5},	
				[9] = {"Ngäc VËn Tiªn Tö", 26, 6},	
				[11] = {"Long §Çu ThÇn C¸i", 26, 7},	
				[12] = {"KhÊt Thiªn ThÇn C¸i", 26, 8},	
				[14] = {"Ch­ëng Kinh ®¹o nh©n", 26, 9},	
				[15] = {"Th¸i Êt T¶n Nh©n", 26, 10},	
				[17] = {"Long T­¬ng t­íng qu©n", 26, 11},	
				[18] = {"Hæ Dùc t­íng qu©n", 26, 12},	
				[20] = {"U Minh Quû S¸t", 26, 13},	
				[21] = {"V« §æng La S¸t", 26, 14},	
				[23] = {"Ch­ëng Kinh ®¹o nh©n", 26, 9},	
				[29] = {"B¹ch Liªn Tiªn Tö", 26, 5},	
				[30] = {"Ngäc VËn Tiªn Tö", 26, 6},									
			},
			
	[4] =	{
				[2] = {"Tr­ëng l·o §¹t Ma §­êng", 27, 1},	
				[4] = {"Tr­ëng l·o La H¸n §­êng", 27, 2},	
				[3] = {"Tr­ëng l·o Tµng Kinh C¸c", 27, 3},	
				[6] = {"Thiªn Thñ Sø Gi¶", 27, 4},	
				[8] = {"Kim Quang Tiªn Tö", 27, 5},	
				[9] = {"Thiªn ¢m Tiªn Tö", 27, 6},	
				[11] = {"ChÊp Ph¸p ThÇn C¸i", 27, 7},	
				[12] = {"Ch­ëng Bæng ThÇn C¸i", 27, 8},	
				[14] = {"Th­îng Thanh §¹o Nh©n", 27, 9},	
				[15] = {"Tö Hµ T¶n Nh©n", 27, 10},	
				[17] = {"TrÊn Qu©n T­íng Qu©n", 27, 11},	
				[18] = {"Chinh Lç T­íng Qu©n", 27, 12},	
				[20] = {"Diªm La Quû S¸t", 27, 13},	
				[21] = {"Cæ §éc La S¸t", 27, 14},	
				[23] = {"Th­îng Thanh §¹o Nh©n", 27, 9},	
				[29] = {"Kim Quang Tiªn Tö", 27, 5},	
				[30] = {"Thiªn ¢m Tiªn Tö", 27, 6},									
			},
			
	[5] = {
				[2] = {"Thñ täa §¹t Ma §­êng", 28, 1},	
				[4] = {"Thñ täa La H¸n §­êng", 28, 2},	
				[3] = {"Thñ täa Tµng Kinh C¸c", 28, 3},	
				[6] = {"Thiªn Thñ ThÇn VÖ", 28, 4},	
				[8] = {"Kim Quang th¸nh n÷", 28, 5},	
				[9] = {"Thiªn ¢m th¸nh n÷", 28, 6},	
				[11] = {"ChÊp Ph¸p tr­ëng l·o", 28, 7},	
				[12] = {"Ch­ëng Bæng tr­ëng l·o", 28, 8},	
				[14] = {"Th­îng Thanh ch©n nh©n", 28, 9},	
				[15] = {"Tö Tiªu th­îng nh©n", 28, 10},	
				[17] = {"TrÊn Qu©n nguyªn so¸i", 28, 11},	
				[18] = {"Chinh Lç nguyªn so¸i", 28, 12},	
				[20] = {"Diªm La t«n gi¶", 28, 13},	
				[21] = {"Cæ §éc t«n gi¶", 28, 14},	
				[23] = {"Th­îng Thanh ch©n nh©n", 28, 9},		
				[29] = {"Kim Quang th¸nh n÷", 28, 5},	
				[30] = {"Thiªn ¢m th¸nh n÷", 28, 6},								
			},
}