DebugOutput = nothing;
TM_SYS_SWITCH = 1;

------------------------------------------------------
TM_TONG_AD_NPC = "<color=green> §¹i Sø Bang Héi: <color>";

TM_TONG_SHENSHOU = {
	[1] = {
		[1] = "TiÓu Hæ",
		[2] = "Trung Hæ",
		[3] = "Hæ tr¾ng",
		[4] = "§¹i Hæ",
	},
	[2] = {
		[1] = "¸c lµ",
		[2] = "TiÓu ¦ng",
		[3] = "Trung ¦ng",
		[4] = "§¹i ¦ng",
	},
	[3] = {
		[1] = "TiÓu Long",
		[2] = "Trung Long",
		[3] = "Háa kú l©n1",
		[4] = "§¹i Long",
	},
	[4] = {
		[1] = "TiÓu kª",
		[2] = "TiÓu Phông",
		[3] = "Trung Phông",
		[4] = "§¹i Phông",
	},
}
TM_TONG_SHENSHOU_MODEL = {
	[1] = {
		[1] = "TF_Tiger1",
		[2] = "TF_Tiger2",
		[3] = "TF_Tiger3",
		[4] = "TF_Tiger4",
	},
	[2] = {
		[1] = "TF_Eagle1",
		[2] = "TF_Eagle2",
		[3] = "TF_Eagle3",
		[4] = "TF_Eagle4",
	},
	[3] = {
		[1] = "TF_Dragon1",
		[2] = "TF_Dragon2",
		[3] = "TF_Dragon3",
		[4] = "TF_Dragon4",
	},
	[4] = {
		[1] = "TF_Phenix1",
		[2] = "TF_Phenix2",
		[3] = "TF_Phenix3",
		[4] = "TF_Phenix4",
	},
}

TM_REVPOS = {
	{1750,4532},
	{1918,4553},
	{1919,4166},
	{1846,4217},
	{1766,4310},
	{1961,4278},
	{1981,4070},
	{2009,4382},
	{1878,4691},
	{1748,4706},
	{1710,4433},
	{1846,4093},
}

TM_SORCE_TABLE = {
	[1] = {
		[1] = 2,
		[2] = 4,
		[3] = 8,
		[4] = 16,
	},
	[2] = {
		[1] = 2,
		[2] = 3,
		[3] = 6,
		[4] = 12,
	},
	[3] = {
		[1] = 1,
		[2] = 2,
		[3] = 4,
		[4] = 8,
	},
	[4] = {
		[1] = 1,
		[2] = 2,
		[3] = 3,
		[4] = 5,
	},
}

TM_RANDOM_EVENT_POS = {
	[1] = {1777,4424},
	[2] = {1742,4367},
	[3] = {1870,4575},
	[4] = {1979,4209},
	[5] = {1979,4398},
	[6] = {1805,4288},
	[7] = {1860,4387},
	[8] = {1825,4500},
	[9] = {1941,4473},
	[10] = {1895,4276},
	[11] = {2026,4149},
	[12] = {2019,4287},
	[13] = {1982,4522},
	[14] = {1910,4625},
	[15] = {1832,4659},
	[16] = {1737,4649},
	[17] = {1705,4332},
	[18] = {1746,4259},
	[19] = {1797,4154},
	[20] = {1943,4107},
	[21] = {1723,4530},
}

TM_RANMDOM_EVEN_NPC = {
	[1] = {"TF_qiangkuang", "V« óy Th­¬ng Cuång", 0},
	[2] = {"TF_niutou", "NhiÕp Hån Ng­u §Çu", 0},
	[3] = {"TF_nubing", "Hé Linh Næ Binh", 0},
	[4] = {"TF_zhufujitan", "Tø Linh Chóc Phóc TÕ §µn", 1},
	[5] = {"TF_shouhujitan", "Tø Linh Thñ Hé TÕ §µn", 1},
	[6] = {"Gi¸ vò khÝ", "Gi¸ vò khÝ", 0},
	[7] = {"Gi¸ khiªn", "Gi¸ khiªn", 0},
	[8] = {"L¸ th¶o d­îc", "L¸ th¶o d­îc", 0},
	[9] = {"Giµy giã", "Giµy giã", 0},
	[10] = {"§èi tho¹i Trung Hæ", "L«i Hæ ThÇn Thó", 1},
};

TM_TMZ_BUFF = {
	["Gi¸ vò khÝ"] = {
		tbuff = {
			{"state_p_attack_percent_add", 100, 60},
			{"state_m_attack_percent_add", 100, 60},
		},
		Msg = "T¨ng lùc c«ng kÝch 100%, kÐo dµi 60 gi©y", 
	},      
	["Gi¸ khiªn"] = {
		tbuff = {
			{"state_receive_half_damage", 100, 60},
		},                                    
		Msg = "Gi¶m thä th­¬ng 100%, kÐo dµi 60 gi©y",
	},
	["L¸ th¶o d­îc"] = {
		tbuff = {
			{"state_life_per_per8f", 500, 10},
		},                                           
		Msg = "Mçi gi©y håi phôc sinh mÖnh",		
	},	
	["Giµy giã"] 	 = {
		tbuff = {
			{"state_illusion_latent", 100, 60}, 
		},                                 
		Msg = "Tµng h×nh, kÐo dµi 60 gi©y",	
	},					  			  
};

----TASK------------------------
TM_TASKID_EXP = 3202;
TM_TASKID_YINJUAN = 3203; --1,2Òø¾í£¬3ËÄÁéÕ½ÆìÁìÈ¡±ê¼Ç£¨ÖÜÇå£©£¬4ËÄÁé¸ß¼¶Õ½ÆìÁìÈ¡±ê¼Ç£¨ÖÜÇå£©

----RelayShareDate--------------
TM_RANK_INMATCHREALM = "_TM_RANK_INMATCHREALM_"
--0, 0 [TongName] = {"d", nSocre};
TM_RANK_INSOURCEREALM = "_TM_RANK_INSOURCEREALM_"
--0, 0 [TongName] = {"ddds", bIsAward, nRank, nSocre, Name};

--Rank Socre-------------------
TM_RANK_SORCE = {
	[1] = 20,	
	[2] = 15,
	[3] = 12,
	[4] = 10,
	[5] = 8,
	[6] = 6,
	[7] = 5,
	[8] = 4,
	[9] = 3,
	[10] = 2,
	[11] = 1,
	[12] = 1,
	[13] = 1,
	[14] = 1,
	[15] = 1,
	[16] = 1,
	[17] = 1,
	[18] = 1,
	[19] = 1,
	[20] = 1,
}

TM_TONG_AWARD = {
	[1]  = {30,2},	
	[2]  = {25,2},
	[3]  = {20,2},
	[4]  = {15,2},
	[5]  = {10,2},
	[6]  = {5,1},
	[7]  = {5,1},
	[8]  = {5,1},
	[9]  = {5,1},
	[10] = {5,1},
	[11] = {5,1},
	[12] = {5,1},
	[13] = {5,1},
	[14] = {5,1},
	[15] = {5,1},
	[16] = {5,1},
	[17] = {5,1},
	[18] = {5,1},
	[19] = {5,1},
	[20] = {5,1},
	[21] = {1,0},	
	[22] = {1,0},
	[23] = {1,0},
	[24] = {1,0},
	[25] = {1,0},
	[26] = {1,0},
	[27] = {1,0},
	[28] = {1,0},
	[29] = {1,0},
	[30] = {1,0},
	[31] = {1,0},
	[32] = {1,0},
	[33] = {1,0},
	[34] = {1,0},
	[35] = {1,0},
	[36] = {1,0},
	[37] = {1,0},
	[38] = {1,0},
	[39] = {1,0},
	[40] = {1,0},
}

TM_TONG_RANK_MAX = 40 --ÅÅÃû×î´óÖµ
