-- ====================== 文件信息 ======================

-- 剑侠情缘onlineII 大理任务变量定义
-- By StarryNight
-- 2005/12/29 PM 15:56

--十一月廿九 丁亥土井闭日  
--宜：  裁衣、筑堤、修仓、修造、动土、上梁、补塞、作灶  
--忌：  理发、嫁娶  

-- 昨晚小偷进屋，室友稍有损失，年关难过啊……

-- ======================================================

--西南世界任务开关
--1:开 0:关
XnTaskSwitch = 1;

TASK_DL_LV10_ID 	 		= 1300;					-- 大理10级女商人任务变量
TASK_DL_LV20_ID 	 		= 1301;					-- 大理20级大理国公任务变量
TASK_DL_LV30_ID 	 		= 1302;					-- 大理30级五毒教主任务变量
TASK_DL_LV35_ID 	 		= 1303;					-- 大理35级武陵山任务变量
TASK_DL_LV35_01_ID 		= 1304;					-- 大理35级武陵山任务分支选择变量
TASK_DL_LV35_ID_ZX 		= 1305;					-- 大理35级武陵山任务分支变量（任务面板用）
TASK_DL_LV40_ID		 		= 1306;					-- 大理40级六大家族任务变量
TASK_DL_LV45_ID 	 		= 1307;					-- 大理45级苗岭信使任务变量
TASK_DL_LV50_ID 	 		= 1308;					-- 大理50级蚩火教的目的任务变量
TASK_DL_LV55_ID 	 		= 1309;					-- 大理55级凤凰翎，大宋名菜任务变量
TASK_DL_LV55_TIME  		= 1310;					-- 大理55级凤凰翎得到道具凤凰翎时间点记录
TASK_DL_LV60_ID 	 		= 1311;					-- 大理60级蚩火僧恶任务变量
TASK_DL_LV60_1_ID  		= 1312;					-- 大理60级郑贯之的债款任务变量（成都舞娘）
TASK_DL_LV60_2_ID  		= 1313;					-- 大理60级郑贯之的债款任务变量（汴京舞娘）
TASK_DL_LV60_0_ID	 		= 1314;					-- 大理60级郑贯之的债款任务帮助面板变量
TASK_DL_LV62_ID		 		= 1315;					-- 大理62级失踪的伙计任务变量
TASK_DL_LV75_ID		 		= 1316;					-- 大理75级五毒教的怒火,郑贯之的身份，郑氏的复仇任务变量	
TASK_DL_LV70_ID		 		= 1317;					-- 大理70级蚩火教的挑战书任务变量
TASK_DL_LV80_ID		 		= 1318;					-- 大理80级任务变量
TASK_DL_LV80_TIME_ID  = 1319;					-- 大理80级任务记录完成二皇子任务后的时间变量 
                        
TASK_DL_LV40_ZX_ID		= 1320;					-- 大理40级分支任务不祥人变量

KILL_DL_POINSONBEE    = 180;			-- 大理10级任务女商人郑贯之毒峰死亡触发器
KILL_DL_POINSONSCO  	= 181;			-- 大理20级任务大理国公高升泉毒蜈蚣死亡触发器
KILL_DL_ANPLANT 			= 182;			-- 大理30级任务五毒教主剧毒食人草死亡触发器
KILL_DL_CHIHUO_WHITE 	= 183;			-- 大理35级任务高升泉武陵山蚩火白教徒死亡触发器
KILL_DL_CHIHUO_BLACK 	= 184;			-- 大理35级任务高升泉武陵山蚩火黑教徒死亡触发器
KILL_DL_CHIHUO_RED 		= 185;			-- 大理35级任务高升泉武陵山蚩火赤教徒死亡触发器
TALK_DL_ZHAOYANNIAN 	= 186;			-- 大理40级任务赵延年对话触发器
KILL_DL_MLHY 					= 187;			-- 大理45级苗岭信使任务苗岭护印死亡触发器
KILL_DL_MLTS					= 188;      -- 大理50级任务苗岭土司死亡触发器
KILL_DL_MIDNIGHT_TIGER= 189;      -- 大理55级任务子夜虎死亡触发器
KILL_DL_BALD_EAGLE    = 190;      -- 大理55级任务白头雕死亡触发器
TALK_DL_MOSAN					= 191;			-- 大理55级任务莫三对话触发器
TIME_DL_PHENIX				= 192;			-- 大理55级任务迦楼罗时间触发器
TALK_DL_SHETAIJUN			= 193;			-- 大理58级任务佘太君对话触发器
KILL_DL_POISONBAT     = 194;			-- 大理60级任务毒蝠计数器	
KILL_DL_BLOODCROW			= 195;			-- 大理60级任务啼夜血鸦死亡触发器
KILL_DL_CREATUREMAN		= 196;			-- 大理62级任务傀儡毒人死亡触发器
KILL_DL_CHIHUO_ELDER	= 197;			-- 大理62级任务蚩火长老死亡触发器
TALK_DL_BAIXIAOSHENG  = 198;			-- 大理75级任务百晓生对话触发器
KILL_DL_JOCKO					= 199;			-- 大理75级任务黑猩猩死亡触发器

KILL_DL_CHIHUO_DAOKE	= 200;			-- 大理40级支线任务蚩火刀客死亡触发器