
-- ====================== ÎÄ¼şĞÅÏ¢ ======================

-- ½£ÏÀÇéÔµonlineII ¹Ò»úµØÍ¼³öÈ¥½Å±¾ÎÄ¼ş
-- Edited by peres
-- 2005/06/27 PM 14:04

-- Ö»ÓĞËûºÍËıÁ½¸öÈË
-- ËûÃÇÏà°®
-- Ëı¼ÇµÃ
-- ËûµÄÊÖ¸§Ä¦ÔÚËıµÄÆ¤·ôÉÏµÄÎÂÇé
-- ËûµÄÇ×ÎÇÏñÄñÈºÔÚÌì¿ÕÂÓ¹ı
-- ËûÔÚËıÉíÌåÀïÃæµÄ±©ìåºÍ·Å×İ
-- ËûÈëË¯Ê±ºòµÄÑù×Ó³äÂú´¿Õæ
-- Ëı¼ÇµÃ£¬Çå³¿ËıĞÑ¹ıÀ´µÄÒ»¿Ì£¬ËûÔÚËıµÄÉí±ß
-- ËıÕö×ÅÑÛ¾¦£¬¿´Êï¹âÍ¸¹ı´°Á±Ò»µãÒ»µãµØÕÕÉä½øÀ´
-- ËıµÄĞÄÀïÒòÎªĞÒ¸£¶øÌÛÍ´

-- ======================================================

-- ¶ÁÈë¹Ò»ú½Å±¾Í·ÎÄ¼ş
Include("\\script\\online\\online_head.lua");

function main()

	Say("N«ng d©n: Ng­¬i muèn ta ®­a vÒ thµnh kh«ng?",
		2,
		"§­îc/Select_Yes",
		"§Ó xem l¹i!/Select_No"
		);

end;


function Select_Yes()
	
	CleanInteractive();
	
	NewWorld(200,1268,2720);
	
	clearLifeState();

end;


function Select_No()

end;

