--кн╫╜
--append by lizhi
--2005-9-10 10:17

--Include("\\script\\lib\\task_main.lua");
Include("\\script\\task\\world\\task_head.lua");
Include("\\script\\task\\world\\task_var_id.lua");
Include("\\script\\task\\world\\lizhi_╫╜╫Р╢Е\\task_main.lua");

function main()
    local nStep = GetTask(TASK_JJC);
    if nStep == 17 then
        task_17_00();
        return
    elseif nStep == 18 then
        task_18_00();
        return
    elseif nStep == 19 then
        task_19_00();
        return
    else
        local szTalk = {
            "Huynh ╝ж ╝Еng lъng hИ quХc b╤o d╘n."
        };
        TalkEx("", szTalk);
    end;
end;
--
--	if CTask:IsTaskFinish("к╝╡╢кн╫╜нЕ")==1 then	--хннЯ╨С
--		Say("<color=green>кн╫╜<color>ё╨ций╔ио╡╩фЗё╛пж╣энрожтзря╬╜йгЁ╞м╒и╫╤╚б╥╣д╣Ц╪Лй╧╪Фй╔╤В╫╚╬Эё╛в╗це╦╨тПв╥дцЁ╞р╟ЁумЩ╪Ип╟ё╛дЦ╣хппвъ╫╜╨Чё╛р╡р╙╫ВиВ╢сйбё╛╡╩©ибрак╥╗╪м╦ыЁё║ё", 0)
--	elseif CTask:CheckTask("к╝╡╢кн╫╜нЕ")==1 then	--мЙЁихннЯ
--		FinishTask005()
--	elseif CTask:IsTaskStart("к╝╡╢кн╫╜нЕ")==1 then	--хннЯжп
--		Say("<color=green>кн╫╜<color>ё╨тУц╢яЫё©╩╧ц╩сп╪Ш╣╫╩йиобПё©дЦ╣╫ЦЙ╬╘урюНй╕й╕оКоК╟Л╥╗╟║║ё", 0)
--	elseif CTask:CheckTask("к╝╡╢кн╫╜кд")==1 then	--мЙЁихннЯ
--		FinishTask004()
--	elseif CTask:IsTaskStart("к╝╡╢кн╫╜кд")==1 then	--хннЯжп
--		Say("<color=green>кн╫╜<color>ё╨╢Р╟э╦ъЕоё╛╤Ах║кШиМио╣даНфЛё╛╧ы╠Ь╬м╩А╡╩у╫втюёак║ё", 0)
--	elseif CTask:CheckTask("к╝╡╢кн╫╜хЩ")==1 then	--мЙЁихннЯ
--		FinishTask003()
--	elseif CTask:IsTaskStart("к╝╡╢кн╫╜хЩ")==1 then	--хннЯжп
--		Say("<color=green>кн╫╜<color>ё╨ь╓╟Ор╩оРсКк╝╡╢╫╩╨цё╛╢╫мЖЁщ╨╝ё╛оК╠ь╡╩╩АпДйжет╧ш║ёдЦуБ╬мх╔ь╓╟Оеэр╩лкё╛гКаЗтзлЛаЗ╟ОжВ©╢тзмЫхугКцФиоё╛бтй╘т╝йж║ё", 0)
--	elseif CTask:CheckCanStart("к╝╡╢кн╫╜хЩ")==1 then	--╫схннЯ
--		StartTask003()
--	elseif CTask:IsTaskFinish("к╝╡╢кн╫╜╤Ч")==1 then	--хннЯ╨С
--		Say("<color=green>кн╫╜<color>ё╨дЦохх╔пщо╒пщо╒ё╛╣х╣╫ак<color=yellow>35╪╤<color>тыю╢урнр║ё", 0)
--	elseif CTask:CheckTask("к╝╡╢кн╫╜╤Ч")==1 then	--мЙЁихннЯ
--		FinishTask002()
--	elseif CTask:IsTaskStart("к╝╡╢кн╫╜╤Ч")==1 then	--хннЯжп
--		Say("<color=green>кн╫╜<color>ё╨вН╫Эспа╫╦Ж╫пкн╨с╨мюН╧М╣д╟эюЮё╛тз╤тцФажвсюОц╟ЁДнр╨мюНЕсё╛и╠хк╥е╩Пё╛гю╫ыг©╪Иё╛╩╣акнрцг╣дцШм╥ё╛й╝╥ж©и╤Яё╛дЦх╔╦Ьнр╟якШцгЁЩ╣Тё╛й╟х║кШцгиМио╣деф╥Шю╢╪Шнрё║║ё", 0)
--	elseif CTask:CheckTask("к╝╡╢кн╫╜р╩")==1 then	--мЙЁихннЯ
--		FinishTask001()
--	elseif CTask:IsTaskStart("к╝╡╢кн╫╜р╩")==1 then	--хннЯжп
--		Say("<color=green>кн╫╜<color>ё╨╧ы╡Н╬мтзи╫об╣др╟жМаж╬мспё╛кФ╠ЦлАр╩╦Ж╧ы╡Н╣ддт╢Эю╢╬м©иртхК╩Оак║ё", 0)
--	elseif CTask:CheckCanStart("к╝╡╢кн╫╜р╩")==1 then	--╫схннЯ
--		StartTask001()
--	else	--хннЯг╟
--		Say("<color=green>кн╫╜<color>ё╨я╖╨ц╧╜бМруё╛╠╗сКкн╧ы╪рё║тшцгкДх╩бД╡щн╙©эё╛╣╚р╡й╠©л╡╩©имЭакжрп╒╢СрЕ╟║ё║║ё", 0)
--	end
--end;
--
--function StartTask001()
--	local strMain = {
--		"<color=green>мФ╪р<color>ё╨ци╤ЧаЗи╫нДкиж╦╣Цё╛лью╢м╤╠╪кн╢С╦Гё╛╩╧мШйуб╪║ё",
--		"<color=green>кн╫╜<color>ё╨тГ╬млЩк╣╤ЧаЗи╫нД╤Чюийгр╩лУоЛ╣╠╣╠╣д╨ц╨╨ё╛дЦ╪хх╩йгкШ╪Жю╢╣дё╛╠ьх╩╠╬йб╡╩╥╡ё╛р╩п╘╥╠ндГх╫з╬мцБакё╛дЦЁЖх╔кджэ╣юб╥©╢©╢ё╛лА╦Жм╤цШв╢тыю╢хК╩Оё║",
--		"<color=green>мФ╪р<color>ё╨мФ╪рё╨╡╩ж╙╨нн╫м╤цШв╢ё©",
--		"<color=green>кн╫╜<color>ё╨╬мйгкФ╠ЦлА╦Ж╧ы╡Н╣ддт╢Эю╢╪Шнр║ё",
--		"<color=green>мФ╪р<color>ё╨╟║ё©ё©ё©",
--		"<color=green>кн╫╜<color>ё╨╟║й╡ц╢ё╛╣╠╧ысп╣╠╧ы╣д╧Ф╬ьё╛бД╡щспбД╡щ╣д╧Ф╬ь║ёуБк╝╡╢юО╢С╢Сп║п║с╒пш╨ц╨╨р╡сп╟ыю╢╦Жё╛╢С╪рф╢акдт╢Эё╛вЖ╣д╤╪йгцП╬евЕ╣дйбё╛дЦ╡╩лА╦Жм╤цШв╢ю╢ё╛к╜╦рпедЦё©╧ы╡Н╬мтзи╫об╣др╟жМаж╬мспё╛кФ╠ЦлАр╩╦Ж╧ы╡Н╣ддт╢Эю╢╬м©иртхК╩Оак║ё",
--}
--	CTask:TalkEx(strMain)
--	CTask:StartTask("к╝╡╢кн╫╜р╩");
--	TaskTip("х╔р╟жМажи╠кю╧ы╡Нё╛лАр╩╦Ж╧ы╡Н╣ддт╢Эю╢хК╩О║ё")
--end
--
--
--function FinishTask001()
--local strMain = {
--	"<color=green>мФ╪р<color>ё╨╢С╦Гё╛нр╣дм╤цШв╢ря╬╜х║╣╫ак║ё",
--	"<color=green>кн╫╜<color>ё╨╨цё╛╫╩╧Щм╤цШв╢ё╛╨х╧Щ╪╕я╙╬фё╛дЦ╬мйгтшцгк╝╡╢╣др╩лУ╨ц╨╨ак║ётшцгк╝╡╢сп10╢Су╞╧Фё╛20лУ╫Дбиё╛30лУйьтРё╛©ийь©и╡╩йь║ё╣╚вНжьр╙р╩лУё╛нрцгр╙й╠©люн╪гнрцг╣д©з╨её╨лФлЛпп╣юё║║ё",
--	"<color=green>мФ╪р<color>ё╨лФлЛпп╣юё║",
--	"<color=green>кн╫╜<color>ё╨вН╫Эспа╫╦Ж╫пкн╨с╨мюН╧М╣д╟эюЮё╛тз╤тцФажвсюОц╟ЁДнр╨мюНЕсё╛и╠хк╥е╩Пё╛гю╫ыг©╪Иё╛╩╣акнрцг╣дцШм╥ё╛й╝╥ж©и╤Яё╛дЦх╔╦Ьнр╟якШцгЁЩ╣Тё╛й╟х║кШцгиМио╣деф╥Шю╢╪Шнрё║║ё",
--}
--	CTask:TalkEx(strMain)
--	CTask:FinishTask("к╝╡╢кн╫╜р╩")
--	CTask:PayAward("к╝╡╢кн╫╜р╩")
--	CTask:StartTask("к╝╡╢кн╫╜╤Ч");
--	TaskTip("гЕЁЩ╤тцФажвсюО╣дкн╨с╨мюН╧Мё╛й╟х║кШцгиМио╣деф╥Шю╢╪Шкн╫╜║ё")
--end;
--
--
--function FinishTask002()
--local strMain = {
--	"<color=green>мФ╪р<color>ё╨╢С╦Гё╛кн╨с╨мюН╧Мря╬╜╠╩нргЕЁЩакё╛уБ╬мйгкШцг╣деф╥Ш║ё",
--	"<color=green>кн╫╜<color>ё╨╤Вё╛уБа╫ькё╛й╣тзйг╦цкю╣д╫Т║ёуБ╪ЧйбдЦ╟Л╣д╨э╨цё╛уБйг╦ЬдЦ╣д╫╠юЬё╛дЦ╧Щ╤нй╠╪Дю╢╪Шнрё╛аМспйбгИн╞еи║ё",
--}
--	CTask:TalkEx(strMain)
--	CTask:FinishTask("к╝╡╢кн╫╜╤Ч")
--	CTask:PayAward("к╝╡╢кн╫╜╤Ч")
--	TaskTip("хннЯрямЙЁиё╛гК╣╫ак30╪╤тыю╢уркн╫╜║ё")
--end;
--
--
--function StartTask003()
--	local strMain = {
--		"<color=green>кн╫╜<color>ё╨дЦю╢╣дуЩ╨цё╛нрря╬╜╣ц╣╫©и©©оШо╒ё╛Ё╞м╒бМио╬мр╙еи╠Ью╢╧╔╢Рк╝╡╢ё╛дЦ©исп╨ц╣дмк╣пж╝╡ъё©",
--		"<color=green>мФ╪р<color>ё╨п║╣дя╟к╪ё╛╧Б©©к╝╡╢р╩╪р╣да╕а©ё╛╣╡╣цакр╩й╠ё╛╣╡╡╩акр╩йюё╛╩╧╣ц╤Юурп╘т╝йж╡е╨ц║ё",
--		"<color=green>кн╫╜<color>ё╨Юеё╛дЦкЫ╪Ш╪╢йг║ёь╓╟Ор╩оРсКк╝╡╢╫╩╨цё╛╢╫мЖЁщ╨╝ё╛оК╠ь╡╩╩АпДйжет╧ш║ёдЦуБ╬мх╔ь╓╟Оеэр╩лкё╛гКаЗтзлЛаЗ╟ОжВ©╢тзмЫхугКцФиоё╛бтй╘т╝йж║ё",
--}
--	CTask:TalkEx(strMain)
--	CTask:StartTask("к╝╡╢кн╫╜хЩ");
--	TaskTip("х╔ь╓╟ОгКаЗтзлЛ╟ОжВт╝жЗк╝╡╢║ё")
--end
--
--
--function FinishTask003()
--local strMain = {
--	"<color=green>мФ╪р<color>ё╨╢С╦Гё╛нрря╬╜Ёи╧╕к╣╥ЧакаЗтзлЛё╛кШкФ╨С╬мбйаЛь╓╟О╣эвс╦ою╢║ё",
--	"<color=green>кн╫╜<color>ё╨ь╓╟Оиооб╧Шх╩рЕфЬ╧Щхкё╛спаккШцг╟Оц╕ё╛йбгИ╬м╨ц╟Л╤Юак║ё╧ы╠Ьря╬╜╣╫аки╫╫её╛бМио╬мр╙ю╢н╖╫какё╛дЦбМиох╔ур╪╦╦Жж╬м╛╣ю╨о╣дпж╣эё╛р╩фПх╔и╠мк╧ы╠Ь║ё",
--	"<color=green>мФ╪р<color>ё╨нруБ╬мх╔║ё",
--	"<color=green>кн╫╜<color>ё╨Юеё╛╧ы╠Ь╢Ь╤с╣дм╥аЛ╫п╦ъЕоё╛дЦж╙╣ю╢Р╟экШё╛╤Ах║кШиМио╣даНфЛ╬мппак║ё",
--}
--	CTask:TalkEx(strMain)
--	CTask:FinishTask("к╝╡╢кн╫╜хЩ")
--	CTask:PayAward("к╝╡╢кн╫╜хЩ")
--	CTask:StartTask("к╝╡╢кн╫╜кд");	
--	TaskTip("х╔урп╘м╛╟Иё╛╢Р╟э╦ъЕоё╛х║╩ькШиМио╣даНфЛ║ё")
--end;
--
--
--function FinishTask004()
--local strMain = {
--	"<color=green>мФ╪р<color>ё╨╢С╦Гё╛нрря╬╜Ёи╧╕╢Р╟эак╦ъЕоё╛уБйгкШ╣даНфЛ║ё",
--	"<color=green>кн╫╜<color>ё╨╨цё╛па©Юак║ё╢сдЦ╣╫к╝╡╢ю╢ё╛нр╬мр╩ж╠тз╧ш╡Лё╛дЦйг╢оцВхкё╛кЫртнр╬Ж╤╗сц╢оцВхк╣д╥╫й╫╦ЗдЦк╣╩╟║ё╢с╠╬жйиок╣ё╛лФлЛпп╣юж╩йгр╩╦Ж©з╨её╛╟╒цжмп╥Пр╡йг║ёнрцглАЁЖуБ╦Ж©з╨её╛йгн╙акбИ╠тдгп╘╡╩╢оцВ╣дхкё╛йгн╙акбД╡щпХр╙║ёнрцгн╙й╡ц╢р╙бД╡щдьё©йгрРн╙нрцгс╟оЛа╕╡╩╧╩╢Сё╛╡╩дэвЖ╧ыё╛р╡ц╩спг╝╨ме╝хк║ёр╙╦д╠ДуБр╩гпё╛╬мр╩╤╗р╙лАЁЖлФлЛпп╣ю╣д©з╨её╛бИ╠т╦Э╤Ю╣дхкё╛жфтЛ╦Э╢С╣дс╟оЛё║",
--	"<color=green>мФ╪р<color>ё╨ак╫Б║ёлФлЛпп╣юё║лФлЛпп╣юё║",
--	"<color=green>кн╫╜<color>ё╨╬╜╧ЩнрЁ╓фз╪Х©Ю╣де╛а╕ё╛нрцг╣дйфа╕ря╬╜╬╙╤╞ак╩йиоё╛уБ╦Жс╟оЛря╬╜╧╩╢Сак║ёкЫртожтзнрспр╩╦Жнёоу╣дхннЯ╫╩╦ЬдЦ║ёдЦр╙╣╫ЦЙ╬╘х╔ё╛иХ╥╗╫с╫ЭюНй╕й╕ё╛м╗╧ЩкЩ╪Ш╣╫╩йиоё╛╩йиохГ╧Ш©оуп╟╡нрцгё╛нрцг╬м©иртвЖ╨э╢С╣д╧ыё╛сп╨э╤Ю╣дг╝╨ме╝хкё╛уБ╦ЖхннЯ╥гЁё╣днёоуё╛╬Ь╤т╡╩дэхц╣з╤Ч╦Жхкж╙╣юё╛спй╡ц╢нйлБц╩спё©",
--	"<color=green>мФ╪р<color>ё╨©и╡╩©ирт╡╩х╔ё©",
--	"<color=green>кн╫╜<color>ё╨╡╩пп║ёуБйг╦Ь╩йио╣дцэпеё╛╩╧спнрк╫хктчжЗдЦ╣д500а╫нфрЬё╛дЦх╔бР╪Ч╦и╬╩╣дрб╥Чё╛©Лх╔©Л╩ьё╛╡╩р╙╤╙к╝╡╢╣даЁ║ё",
--}
--	CTask:TalkEx(strMain)
--	CTask:FinishTask("к╝╡╢кн╫╜кд")
--	CTask:PayAward("к╝╡╢кн╫╜кд")
--	CTask:StartTask("к╝╡╢кн╫╜нЕ");	
--	TaskTip("х╔ЦЙ╬╘урюНй╕й╕ё╛иХ╥╗╫с╫Э╩йио║ё")
--end;