--ฝลฑพร๛ณฦฃบสฆรลพ๗าชฐüสนำรฝลฑพ
--ฝลฑพนฆฤÜฃบอๆผาสนำรฝลฑพบ๓ฃฌหๆป๚ธ๘อๆผาิ๖ผำศฮาโาปธ๖รลลษตฤศฮาโมฝฑพพ๗าช
--ด๚ย๋ฑเะดศหฃบดๅณค
--ด๚ย๋ฑเะดสฑผไฃบ2007-01-28
--ะÞธฤผวยผฃบะกภถด๒ฒนถก
Include("\\script\\online\\zgc_public_fun.lua")		--ดๅณคตฤนซนฒบฏสý
--=================================นซนฒฑไมฟถจาๅว๘============================
jue_list = {
		{{"ษูมึตถทจพ๗าช",2,6,1},
		{"ษูมึน๗ทจพ๗าช",2,6,2},
		{"ีถฤงตถทจพ๗าช",2,6,3},
		{"ทโฤงน๗ทจพ๗าช",2,6,4},
		{"ฝ๐ึำีึพ๗าช",2,6,5},
		{"ศผฤพตถทจพ๗าช",2,6,6},
		{"ฮÞณฃน๗ทจพ๗าช",2,6,7},
		{"ษแษํพ๗พ๗าช",2,6,8},
		{"ด๓ณหศ็ภดะฤทจพ๗าช",2,6,9},
		{"ด๏ฤฆฮไพญพ๗าช",2,6,10},
		{"ฦ฿ฑฆษ๑ีีะฤทจพ๗าช",2,6,11},
		{"ยÞบบศญพ๗าช",2,6,12},
		{"ๅศาถอศพ๗าช",2,6,13},
		{"ปÛัÛึไพ๗าช",2,6,14},
		{"ฮคอำศญพ๗าช",2,6,15},
		{"ฮฤสโณ๖ิฦอศพ๗าช",2,6,16},
		{"ยÞบบี๓พ๗าช",2,6,17},
		{"ด๓ะ๋รึีฦพ๗าช",2,6,18},
		{"ฮÞำฐฝลพ๗าช",2,6,19},
		{"ษูมึม๚ืฆสึพ๗าช",2,6,20},
		{"ทüปขฦ๘นฆพ๗าช",2,6,21},
		{"ษูมึะÞะฤทจพ๗าช",2,6,22},
		{"ฮๅืชึธพ๗าช",2,6,23},
		{"ฦฦฤงึไพ๗าช",2,6,24},
		{"ฝ๐ธีฒปปตพ๗าช",2,6,25},
		{"า๒อำยÞภืำกฦฦพ๗าช",2,6,26},
		{"๔ย๔ฤทüฤงษ๑อจพ๗าช",2,6,27},
		{"ฮÞฯเษ๑นฆพ๗าช",2,6,28},
		{"สจืำบ๐พ๗าช",2,6,29},
		{"ฒปถฏร๗อ๕ึไพ๗าช",2,6,30},
		{"ด๓มฆฝ๐ธีึธพ๗าช",2,6,31}},
		{{"ฐตฦ๗ึฦื๗ส๕พ๗าช",2,6,32},
		{"ะฤัÛพ๗าช",2,6,33},
		{"ถพดฬนวพ๗าช",2,6,34},
		{"ฝโถพรุส๕พ๗าช",2,6,35},
		{"นดปฺ๊ๅพ๗าช",2,6,36},
		{"ป๚นุฦฦฝโส๕พ๗าช",2,6,37},
		{"ืทะฤผýพ๗าช",2,6,38},
		{"ว๏บมร๗ฒ้พ๗าช",2,6,39},
		{"ดฉะฤดฬพ๗าช",2,6,40},
		{"ดใถพรุส๕พ๗าช",2,6,41},
		{"ถแฦวแฆพ๗าช",2,6,42},
		{"ฑฉำ๊ภๆปจี๋พ๗าช",2,6,43},
		{"บฌษณษไำฐพ๗าช",2,6,44},
		{"ห๘รüี๋พ๗าช",2,6,45},
		{"ย๚ฬ์ปจำ๊พ๗าช",2,6,46}},
		{{"นÛา๔พ๗พ๗าช",2,6,47},
		{"ถ๋แาท๐าโพ๗าช",2,6,48},
		{"ำ๑ลฎฝฃทจพ๗าช",2,6,49},
		{"ถษิชพ๗พ๗าช",2,6,50},
		{"ท๐นโฦีีีพ๗าช",2,6,51},
		{"มซปชะฤพญพ๗าช",2,6,52},
		{"วๅา๔่๓ณชพ๗าช",2,6,53},
		{"ม๗หฎพ๗พ๗าช",2,6,54},
		{"ฦีผรึฺษ๚พ๗าช",2,6,55},
		{"ฒปร๐ะฤทจพ๗าช",2,6,56},
		{"ท๐นโีฝฦ๘พ๗าช",2,6,57},
		{"ท๐า๔ีฝาโพ๗าช",2,6,58},
		{"ด๓ดศด๓ฑฏึไพ๗าช",2,6,59},
		{"หๆาโว๚พ๗าช",2,6,60},
		{"ว๚าีพซอจพ๗าช",2,6,61},
		{"ิยสดว๚พ๗าช",2,6,62},
		{"ถฯหฎะฤทจพ๗าช",2,6,63},
		{"พฒานหผพ๗าช",2,6,64},
		{"ำเา๔ศฦมบนฆพ๗าช",2,6,65},
		{"ั๔นุศýตþพ๗าช",2,6,66},
		{"ธฒหฎะฤทจพ๗าช",2,6,67},
		{"ทูวูึ๓บืพ๗พ๗าช",2,6,68},
		{"ฮฺานฬไพ๗าช",2,6,69},
		{"ริะฤฦฎฯใว๚พ๗าช",2,6,70}},
		{{"ุคฐ๏ีฦทจพ๗าช",2,6,71},
		{"อจฑÛศญพ๗าช",2,6,72},
		{"วงฝ๏ีขพ๗าช",2,6,73},
		{"ฐิอ๕ศญพ๗าช",2,6,74},
		{"ห๘บํวÜฤรสึพ๗าช",2,6,75},
		{"ๅะาฃำฮพ๗าช",2,6,76},
		{"ม๙บฯศญทจพ๗าช",2,6,77},
		{"ืํต๛พ๗าช",2,6,78},
		{"ืํศญพ๗าช",2,6,79},
		{"ุคฐ๏น๗ทจพ๗าช",2,6,80},
		{"วýษ฿น๗ทจพ๗าช",2,6,81},
		{"ฦ๒ฬ์ฬึตุพ๗าช",2,6,82},
		{"ฤเ๖๚นฆพ๗าช",2,6,83},
		{"ร๎สึพ๗พ๗าช",2,6,84},
		{"อตม๚ืชท๏พ๗าช",2,6,85},
		{"ฐิอ๕ะถผืพ๗าช",2,6,86},
		{"อตฬ์ปปศีพ๗าช",2,6,87},
		{"ด๒นทน๗ทจพ๗าช",2,6,88}},
		{{"ฮไตฑฝฃทจพ๗าช",2,6,89},
		{"ม๗นโฝฃทจพ๗าช",2,6,90},
		{"ฮดั๋ฝฃทจพ๗าช",2,6,91},
		{"ศแิฦฝฃทจพ๗าช",2,6,92},
		{"มาัๆฝฃทจพ๗าช",2,6,93},
		{"ฑผภืฝฃพ๗พ๗าช",2,6,94},
		{"ฮÞฮาะฤทจพ๗าช",2,6,95},
		{"ฬซวๅฝฃฦ๘พ๗าช",2,6,96},
		{"ฒ๘รฮฝฃาโพ๗าช",2,6,97},
		{"ยไหชฝฃาโพ๗าช",2,6,98},
		{"ึหั๔ฝฃฦ๘พ๗าช",2,6,99},
		{"ะþฮไฝฃี๓พ๗าช",2,6,100},
		{"ำ๙ฝฃพ๗พ๗าช",2,6,101},
		{"ีýมฝาวฝฃทจพ๗าช",2,6,102},
		{"ฬซาาศýวๅฝฃพ๗าช",2,6,103},
		{"ษ๑รลสฎศýฝฃพ๗าช",2,6,104},
		{"ตุฤþะþา๕ฝฃพ๗าช",2,6,105},
		{"ฬ์วๅดฟั๔ฝฃพ๗าช",2,6,106},
		{"ฐหุิฝฃฦ๘พ๗าช",2,6,107},
		{"ีๆฮไฦ฿ฝุฝฃพ๗าช",2,6,108},
		{"ฮไตฑฑสทจพ๗าช",2,6,109},
		{"ฬซาาๅะาฃนฆพ๗าช",2,6,110},
		{"ม๙ฦ๘ปฏำ๑นฆพ๗าช",2,6,111},
		{"ฬÝิฦืÝพ๗าช",2,6,112},
		{"ฦ฿ะวพ๗พ๗าช",2,6,113},
		{"ษูั๔พ๗พ๗าช",2,6,114},
		{"ษูา๕พ๗พ๗าช",2,6,115},
		{"ฑฑถทฦ฿ะวี๓พ๗าช",2,6,116},
		{"ฒะำฐพ๗พ๗าช",2,6,117},
		{"วฌภคพ๗พ๗าช",2,6,118},
		{"ษฯวๅฮÞผซนฆพ๗าช",2,6,119}},
		{{"ั๎ผาวนทจพ๗าช",2,6,120},
		{"ั๎ผาฦฦท็วนพ๗าช",2,6,121},
		{"ั๎ผาิฆยํส๕พ๗าช",2,6,122},
		{"ั๎ผาฑผภววนพ๗าช",2,6,123},
		{"ั๎ผาีฝถจพ๗พ๗าช",2,6,124},
		{"ั๎ผาวษีฝพ๗พ๗าช",2,6,125},
		{"ั๎ผาฬ์บโวนพ๗าช",2,6,126},
		{"ั๎ผาำขะÛฦ๘พ๗าช",2,6,127},
		{"ั๎ผาตนบฃวนพ๗าช",2,6,128},
		{"ั๎ผาำ๙ยํส๕พ๗าช",2,6,129},
		{"ฑฬิยทษะววนพ๗าช",2,6,130},
		{"ั๎ผานญทจพ๗าช",2,6,131},
		{"ั๎ผามฌษไส๕พ๗าช",2,6,132},
		{"ั๎ผาี๓มฦส๕พ๗าช",2,6,133},
		{"ั๎ผาปุม๚ผýพ๗าช",2,6,134},
		{"ั๎ผาฒ๘ิฦผýพ๗าช",2,6,135},
		{"ั๎ผาฦๆรลถÜพ๗าช",2,6,136},
		{"ั๎ผาีýฦ๘ผýพ๗าช",2,6,137},
		{"ั๎ผาห้ฝ๐ผýพ๗าช",2,6,138},
		{"ั๎ผาปรษ๑พ๗พ๗าช",2,6,139},
		{"ั๎ผาะ๘รüพ๗พ๗าช",2,6,140},
		{"ม๗นโพ๘ำฐผýพ๗าช",2,6,141}},
		{{"ฮๅถพตถทจพ๗าช",2,6,142},
		{"าýป๊ึไพ๗าช",2,6,143},
		{"ฒูสฌส๕พ๗าช",2,6,144},
		{"สฌถพส๕พ๗าช",2,6,145},
		{"สฌฑฌด๓ทจพ๗าช",2,6,146},
		{"ผฏสฌะฐฦ๘พ๗าช",2,6,147},
		{"ิฆสฌส๕พ๗าช",2,6,148},
		{"อ๒ถพถแรüตถพ๗าช",2,6,149},
		{"า๕ะฐฮüป๊ฦ๘พ๗าช",2,6,150},
		{"ด฿สฌะฐฦ๘พ๗าช",2,6,151},
		{"ะฐม้ด๓ทจพ๗าช",2,6,152},
		{"ะฐถพนฆพ๗าช",2,6,153},
		{"สฌมัฤงนฆพ๗าช",2,6,154},
		{"ฯยนฦรุทฝพ๗าช",2,6,155},
		{"ท่นฦพ๗าช",2,6,156},
		{"ั๘นฦรุส๕พ๗าช",2,6,157},
		{"ฟ๑ท็ืฆพ๗าช",2,6,158},
		{"ถพนฦพ๗าช",2,6,159},
		{"ัชถฆนฆพ๗าช",2,6,160},
		{"ัชนฦพ๗าช",2,6,161},
		{"ฯในฦพ๗าช",2,6,162},
		{"สฌนฦพ๗าช",2,6,163},
		{"ัýนฦพ๗าช",2,6,164},
		{"ะฤนฦพ๗าช",2,6,165},
		{"อ๒นฦสดฬ์พ๗าช",2,6,166},
		{"ปรนฦพ๗าช",2,6,167},
		{"ะQนฦพ๗าช",2,6,168}},
}
jue_id = {	{607,"ษูมึพ๗าชฐü"},
			{608,"ฬฦรลพ๗าชฐü"},
			{609,"ถ๋แาพ๗าชฐü"},
			{610,"ุคฐ๏พ๗าชฐü"},
			{611,"ฮไตฑพ๗าชฐü"},
			{612,"ั๎รลพ๗าชฐü"},
			{613,"ฮๅถพพ๗าชฐü"}}
--==================================ฝลฑพึ๗ย฿ผญว๘=============================
function OnUse(goods_index)
	local goods_id = GetItemParticular(goods_index)
	local goods_diff = 0
	for i =1, getn(jue_id) do
		if goods_id == jue_id[i][1] then
			goods_diff = i
			break
		end
	end
	Say("S๖ d๔ng t๓i bÝ kiีp sฯ may mพn nhหn ฎญ๎c cธc loนi yีu quyีt mซn phธi. S๖ d๔ng?",2,
	"งๅng ý!/#goods_use_det("..goods_diff..")",
	"Chญa cวn/end_dialog"
	)
end

function end_dialog()
end

--***********************************ฮ๏ฦทสนำรว๘******************************
function goods_use_det(goods_diff)
	if Zgc_pub_goods_add_chk(5,50) ~= 1 then		--ฟีผไ/ธบึุละถฯ
		Talk(1,"","ว๋ศทศฯฤ๚ตฤฑณฐüำะืในปตฤธบึุบอฟีผไฃก")
		return
	end
	if GetItemCount(2,0,jue_id[goods_diff][1]) == 0 then
		Talk(1,"","ว๋ศทศฯฤ๚ตฤฐüนüึะำะ<color=red>"..jue_id[goods_diff][2].."<color>ฃก")
		return
	end
	if DelItem(2,0,jue_id[goods_diff][1],1) ~= 1 then
		Talk(1,"","ว๋ศทศฯฤ๚ตฤฐüนüึะำะ<color=red>"..jue_id[goods_diff][2].."<color>ฃก")
		return
	else
		for i = 1, 5 do
			local ran_num = random(1,getn(jue_list[goods_diff]))
			local add_flag = AddItem(jue_list[goods_diff][ran_num][2],jue_list[goods_diff][ran_num][3],jue_list[goods_diff][ran_num][4],1)
			if add_flag == 1 then
				Msg2Player("ฤใป๑ตราปฑพ:\""..jue_list[goods_diff][ran_num][1].."\"")
			else
				WriteLog(GetName().."ป๑ตรฝฑภ๘ฃบ"..jue_list[goods_diff][ran_num][1].."ิ๖ผำสงฐÜฃฌสงฐÜฑ๊ึพฃบ"..add_flag)
			end
		end
	end	
end
